m-labs/dslite2svd/svd/tm4c123x-vendor.xml
        <register>
          <name>IM</name>
          <displayName>UART_IM</displayName>
          <description>UART Interrupt Mask</description>
          <addressOffset>0x00000038</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CTSMIM</name>
              <description>UART Clear to Send Modem Interrupt Mask</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RXIM</name>
              <description>UART Receive Interrupt Mask</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TXIM</name>
              <description>UART Transmit Interrupt Mask</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RTIM</name>
              <description>UART Receive Time-Out Interrupt Mask</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>FEIM</name>
              <description>UART Framing Error Interrupt Mask</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PEIM</name>
              <description>UART Parity Error Interrupt Mask</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>BEIM</name>
              <description>UART Break Error Interrupt Mask</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>OEIM</name>
              <description>UART Overrun Error Interrupt Mask</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>_9BITIM</name>
              <description>9-Bit Mode Interrupt Mask</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>RIS</name>
          <displayName>UART_RIS</displayName>
          <description>UART Raw Interrupt Status</description>
          <addressOffset>0x0000003C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CTSRIS</name>
              <description>UART Clear to Send Modem Raw Interrupt Status</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RXRIS</name>
              <description>UART Receive Raw Interrupt Status</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TXRIS</name>
              <description>UART Transmit Raw Interrupt Status</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RTRIS</name>
              <description>UART Receive Time-Out Raw Interrupt Status</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>FERIS</name>
              <description>UART Framing Error Raw Interrupt Status</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PERIS</name>
              <description>UART Parity Error Raw Interrupt Status</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>BERIS</name>
              <description>UART Break Error Raw Interrupt Status</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>OERIS</name>
              <description>UART Overrun Error Raw Interrupt Status</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>_9BITRIS</name>
              <description>9-Bit Mode Raw Interrupt Status</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>MIS</name>
          <displayName>UART_MIS</displayName>
          <description>UART Masked Interrupt Status</description>
          <addressOffset>0x00000040</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CTSMIS</name>
              <description>UART Clear to Send Modem Masked Interrupt Status</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RXMIS</name>
              <description>UART Receive Masked Interrupt Status</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TXMIS</name>
              <description>UART Transmit Masked Interrupt Status</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RTMIS</name>
              <description>UART Receive Time-Out Masked Interrupt Status</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>FEMIS</name>
              <description>UART Framing Error Masked Interrupt Status</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PEMIS</name>
              <description>UART Parity Error Masked Interrupt Status</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>BEMIS</name>
              <description>UART Break Error Masked Interrupt Status</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>OEMIS</name>
              <description>UART Overrun Error Masked Interrupt Status</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>_9BITMIS</name>
              <description>9-Bit Mode Masked Interrupt Status</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>ICR</name>
          <displayName>UART_ICR</displayName>
          <description>UART Interrupt Clear</description>
          <addressOffset>0x00000044</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CTSMIC</name>
              <description>UART Clear to Send Modem Interrupt Clear</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>write-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RXIC</name>
              <description>Receive Interrupt Clear</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>write-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TXIC</name>
              <description>Transmit Interrupt Clear</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>write-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RTIC</name>
              <description>Receive Time-Out Interrupt Clear</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>write-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>FEIC</name>
              <description>Framing Error Interrupt Clear</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>write-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PEIC</name>
              <description>Parity Error Interrupt Clear</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>write-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>BEIC</name>
              <description>Break Error Interrupt Clear</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>write-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>OEIC</name>
              <description>Overrun Error Interrupt Clear</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>write-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>_9BITIC</name>
              <description>9-Bit Mode Interrupt Clear</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>write-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACTL</name>
          <displayName>UART_DMACTL</displayName>
          <description>UART DMA Control</description>
          <addressOffset>0x00000048</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RXDMAE</name>
              <description>Receive DMA Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TXDMAE</name>
              <description>Transmit DMA Enable</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DMAERR</name>
              <description>DMA on Error</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>_9BITADDR</name>
          <displayName>UART_9BITADDR</displayName>
          <description>UART 9-Bit Self Address</description>
          <addressOffset>0x000000A4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Self Address for 9-Bit Mode</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>_9BITEN</name>
              <description>Enable 9-Bit Mode</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>_9BITAMASK</name>
          <displayName>UART_9BITAMASK</displayName>
          <description>UART 9-Bit Self Address Mask</description>
          <addressOffset>0x000000A8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MASK</name>
              <description>Self Address Mask for 9-Bit Mode</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PP</name>
          <displayName>UART_PP</displayName>
          <description>UART Peripheral Properties</description>
          <addressOffset>0x00000FC0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SC</name>
              <description>Smart Card Support</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>NB</name>
              <description>9-Bit Support</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>CC</name>
          <displayName>UART_CC</displayName>
          <description>UART Clock Configuration</description>
          <addressOffset>0x00000FC8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CS</name>
              <description>UART Baud Clock Source</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCLK</name>
                  <description>System clock (based on clock source and divisor factor)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIOSC</name>
                  <description>PIOSC</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
