m-labs/dslite2svd/svd/tm4c123x-vendor.xml
      </registers>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4cc231e6pm/uart.xml -->
    <peripheral derivedFrom="UART0">
      <name>UART1</name>
      <baseAddress>0x4000D000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4cc231e6pm/uart.xml -->
    <peripheral derivedFrom="UART0">
      <name>UART2</name>
      <baseAddress>0x4000E000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4cc231e6pm/uart.xml -->
    <peripheral derivedFrom="UART0">
      <name>UART3</name>
      <baseAddress>0x4000F000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4cc231e6pm/uart.xml -->
    <peripheral derivedFrom="UART0">
      <name>UART4</name>
      <baseAddress>0x40010000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4cc231e6pm/uart.xml -->
    <peripheral derivedFrom="UART0">
      <name>UART5</name>
      <baseAddress>0x40011000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4cc231e6pm/uart.xml -->
    <peripheral derivedFrom="UART0">
      <name>UART6</name>
      <baseAddress>0x40012000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4cc231e6pm/uart.xml -->
    <peripheral derivedFrom="UART0">
      <name>UART7</name>
      <baseAddress>0x40013000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4cc231e6pm/i2c.xml -->
    <peripheral>
      <name>I2C0</name>
      <description>I2C register offsets</description>
      <baseAddress>0x40020000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
      <registers>
        <register>
          <name>MSA</name>
          <displayName>I2C_MSA</displayName>
          <description>I2C Master Slave Address</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RS</name>
              <description>Receive not send</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>SA</name>
              <description>I2C Slave Address</description>
              <lsb>1</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MCS</name>
          <displayName>I2C_MCS</displayName>
          <description>I2C Master Control/Status</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RUN</name>
              <description>I2C Master Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>BUSY</name>
              <description>I2C Busy</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ERROR</name>
              <description>Error</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>START</name>
              <description>Generate START</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ADRACK</name>
              <description>Acknowledge Address</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>STOP</name>
              <description>Generate STOP</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ACK</name>
              <description>Data Acknowledge Enable</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DATACK</name>
              <description>Acknowledge Data</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ARBLST</name>
              <description>Arbitration Lost</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>HS</name>
              <description>High-Speed Enable</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>IDLE</name>
              <description>I2C Idle</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>BUSBSY</name>
              <description>Bus Busy</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CLKTO</name>
              <description>Clock Timeout Error</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>MDR</name>
          <displayName>I2C_MDR</displayName>
          <description>I2C Master Data</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DATA</name>
              <description>This byte contains the data transferred during a transaction</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MTPR</name>
          <displayName>I2C_MTPR</displayName>
          <description>I2C Master Timer Period</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TPR</name>
              <description>Timer Period</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>HS</name>
              <description>High-Speed Enable</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>MIMR</name>
          <displayName>I2C_MIMR</displayName>
          <description>I2C Master Interrupt Mask</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>IM</name>
              <description>Master Interrupt Mask</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CLKIM</name>
              <description>Clock Timeout Interrupt Mask</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>MRIS</name>
          <displayName>I2C_MRIS</displayName>
          <description>I2C Master Raw Interrupt Status</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RIS</name>
              <description>Master Raw Interrupt Status</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CLKRIS</name>
              <description>Clock Timeout Raw Interrupt Status</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>MMIS</name>
          <displayName>I2C_MMIS</displayName>
          <description>I2C Master Masked Interrupt Status</description>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MIS</name>
              <description>Masked Interrupt Status</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CLKMIS</name>
              <description>Clock Timeout Masked Interrupt Status</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>MICR</name>
          <displayName>I2C_MICR</displayName>
          <description>I2C Master Interrupt Clear</description>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>IC</name>
              <description>Master Interrupt Clear</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>write-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CLKIC</name>
              <description>Clock Timeout Interrupt Clear</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>write-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>MCR</name>
          <displayName>I2C_MCR</displayName>
          <description>I2C Master Configuration</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LPBK</name>
              <description>I2C Loopback</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MFE</name>
              <description>I2C Master Function Enable</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>SFE</name>
              <description>I2C Slave Function Enable</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>GFE</name>
              <description>I2C Glitch Filter Enable</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>MCLKOCNT</name>
          <displayName>I2C_MCLKOCNT</displayName>
          <description>I2C Master Clock Low Timeout Count</description>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CNTL</name>
              <description>I2C Master Count</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MBMON</name>
          <displayName>I2C_MBMON</displayName>
          <description>I2C Master Bus Monitor</description>
          <addressOffset>0x0000002C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SCL</name>
              <description>I2C SCL Status</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>SDA</name>
              <description>I2C SDA Status</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>MCR2</name>
          <displayName>I2C_MCR2</displayName>
          <description>I2C Master Configuration 2</description>
          <addressOffset>0x00000038</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>GFPW</name>
              <description>I2C Glitch Filter Pulse Width</description>
              <lsb>4</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BYPASS</name>
                  <description>Bypass</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_1</name>
                  <description>1 clock</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_2</name>
                  <description>2 clocks</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_3</name>
                  <description>3 clocks</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_4</name>
                  <description>4 clocks</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_8</name>
                  <description>8 clocks</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_16</name>
                  <description>16 clocks</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_31</name>
                  <description>31 clocks</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SOAR</name>
          <displayName>I2C_SOAR</displayName>
          <description>I2C Slave Own Address</description>
          <addressOffset>0x00000800</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OAR</name>
              <description>I2C Slave Own Address</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
