m-labs/dslite2svd/svd/tm4c123x-vendor.xml
        <register>
          <name>SCSR</name>
          <displayName>I2C_SCSR</displayName>
          <description>I2C Slave Control/Status</description>
          <addressOffset>0x00000804</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DA</name>
              <description>Device Active</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RREQ</name>
              <description>Receive Request</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TREQ</name>
              <description>Transmit Request</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>FBR</name>
              <description>First Byte Received</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>OAR2SEL</name>
              <description>OAR2 Address Matched</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SDR</name>
          <displayName>I2C_SDR</displayName>
          <description>I2C Slave Data</description>
          <addressOffset>0x00000808</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DATA</name>
              <description>Data for Transfer</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SIMR</name>
          <displayName>I2C_SIMR</displayName>
          <description>I2C Slave Interrupt Mask</description>
          <addressOffset>0x0000080C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DATAIM</name>
              <description>Data Interrupt Mask</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>STARTIM</name>
              <description>Start Condition Interrupt Mask</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>STOPIM</name>
              <description>Stop Condition Interrupt Mask</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SRIS</name>
          <displayName>I2C_SRIS</displayName>
          <description>I2C Slave Raw Interrupt Status</description>
          <addressOffset>0x00000810</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DATARIS</name>
              <description>Data Raw Interrupt Status</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>STARTRIS</name>
              <description>Start Condition Raw Interrupt Status</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>STOPRIS</name>
              <description>Stop Condition Raw Interrupt Status</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SMIS</name>
          <displayName>I2C_SMIS</displayName>
          <description>I2C Slave Masked Interrupt Status</description>
          <addressOffset>0x00000814</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DATAMIS</name>
              <description>Data Masked Interrupt Status</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>STARTMIS</name>
              <description>Start Condition Masked Interrupt Status</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>STOPMIS</name>
              <description>Stop Condition Masked Interrupt Status</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SICR</name>
          <displayName>I2C_SICR</displayName>
          <description>I2C Slave Interrupt Clear</description>
          <addressOffset>0x00000818</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DATAIC</name>
              <description>Data Interrupt Clear</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>write-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>STARTIC</name>
              <description>Start Condition Interrupt Clear</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>write-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>STOPIC</name>
              <description>Stop Condition Interrupt Clear</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>write-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SOAR2</name>
          <displayName>I2C_SOAR2</displayName>
          <description>I2C Slave Own Address 2</description>
          <addressOffset>0x0000081C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OAR2</name>
              <description>I2C Slave Own Address 2</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>OAR2EN</name>
              <description>I2C Slave Own Address 2 Enable</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SACKCTL</name>
          <displayName>I2C_SACKCTL</displayName>
          <description>I2C Slave ACK Control</description>
          <addressOffset>0x00000820</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ACKOEN</name>
              <description>I2C Slave ACK Override Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ACKOVAL</name>
              <description>I2C Slave ACK Override Value</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PP</name>
          <displayName>I2C_PP</displayName>
          <description>I2C Peripheral Properties</description>
          <addressOffset>0x00000FC0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HS</name>
              <description>High-Speed Capable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PC</name>
          <displayName>I2C_PC</displayName>
          <description>I2C Peripheral Configuration</description>
          <addressOffset>0x00000FC4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HS</name>
              <description>High-Speed Capable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
