m-labs/dslite2svd/svd/tm4c123x-vendor.xml
        <register>
          <name>_3_CTL</name>
          <displayName>PWM_3_CTL</displayName>
          <description>PWM3 Control</description>
          <addressOffset>0x00000100</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>PWM Block Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MODE</name>
              <description>Counter Mode</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DEBUG</name>
              <description>Debug Mode</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>LOADUPD</name>
              <description>Load Register Update Mode</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CMPAUPD</name>
              <description>Comparator A Update Mode</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CMPBUPD</name>
              <description>Comparator B Update Mode</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>GENAUPD</name>
              <description>PWMnGENA Update Mode</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>I</name>
                  <description>Immediate</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LS</name>
                  <description>Locally Synchronized</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GS</name>
                  <description>Globally Synchronized</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GENBUPD</name>
              <description>PWMnGENB Update Mode</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>I</name>
                  <description>Immediate</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LS</name>
                  <description>Locally Synchronized</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GS</name>
                  <description>Globally Synchronized</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DBCTLUPD</name>
              <description>PWMnDBCTL Update Mode</description>
              <lsb>10</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>I</name>
                  <description>Immediate</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LS</name>
                  <description>Locally Synchronized</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GS</name>
                  <description>Globally Synchronized</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DBRISEUPD</name>
              <description>PWMnDBRISE Update Mode</description>
              <lsb>12</lsb>
              <msb>13</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>I</name>
                  <description>Immediate</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LS</name>
                  <description>Locally Synchronized</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GS</name>
                  <description>Globally Synchronized</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DBFALLUPD</name>
              <description>PWMnDBFALL Update Mode</description>
              <lsb>14</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>I</name>
                  <description>Immediate</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LS</name>
                  <description>Locally Synchronized</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GS</name>
                  <description>Globally Synchronized</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLTSRC</name>
              <description>Fault Condition Source</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MINFLTPER</name>
              <description>Minimum Fault Period</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>LATCH</name>
              <description>Latch Fault Input</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>_3_INTEN</name>
          <displayName>PWM_3_INTEN</displayName>
          <description>PWM3 Interrupt and Trigger Enable</description>
          <addressOffset>0x00000104</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INTCNTZERO</name>
              <description>Interrupt for Counter=0</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INTCNTLOAD</name>
              <description>Interrupt for Counter=PWMnLOAD</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INTCMPAU</name>
              <description>Interrupt for Counter=PWMnCMPA Up</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INTCMPAD</name>
              <description>Interrupt for Counter=PWMnCMPA Down</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INTCMPBU</name>
              <description>Interrupt for Counter=PWMnCMPB Up</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INTCMPBD</name>
              <description>Interrupt for Counter=PWMnCMPB Down</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TRCNTZERO</name>
              <description>Trigger for Counter=0</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TRCNTLOAD</name>
              <description>Trigger for Counter=PWMnLOAD</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TRCMPAU</name>
              <description>Trigger for Counter=PWMnCMPA Up</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TRCMPAD</name>
              <description>Trigger for Counter=PWMnCMPA Down</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TRCMPBU</name>
              <description>Trigger for Counter=PWMnCMPB Up</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TRCMPBD</name>
              <description>Trigger for Counter=PWMnCMPB Down</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>_3_RIS</name>
          <displayName>PWM_3_RIS</displayName>
          <description>PWM3 Raw Interrupt Status</description>
          <addressOffset>0x00000108</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INTCNTZERO</name>
              <description>Counter=0 Interrupt Status</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INTCNTLOAD</name>
              <description>Counter=Load Interrupt Status</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INTCMPAU</name>
              <description>Comparator A Up Interrupt Status</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INTCMPAD</name>
              <description>Comparator A Down Interrupt Status</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INTCMPBU</name>
              <description>Comparator B Up Interrupt Status</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INTCMPBD</name>
              <description>Comparator B Down Interrupt Status</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>_3_ISC</name>
          <displayName>PWM_3_ISC</displayName>
          <description>PWM3 Interrupt Status and Clear</description>
          <addressOffset>0x0000010C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INTCNTZERO</name>
              <description>Counter=0 Interrupt</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INTCNTLOAD</name>
              <description>Counter=Load Interrupt</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INTCMPAU</name>
              <description>Comparator A Up Interrupt</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INTCMPAD</name>
              <description>Comparator A Down Interrupt</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INTCMPBU</name>
              <description>Comparator B Up Interrupt</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INTCMPBD</name>
              <description>Comparator B Down Interrupt</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>_3_LOAD</name>
          <displayName>PWM_3_LOAD</displayName>
          <description>PWM3 Load</description>
          <addressOffset>0x00000110</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LOAD</name>
              <description>Counter Load Value</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>_3_COUNT</name>
          <displayName>PWM_3_COUNT</displayName>
          <description>PWM3 Counter</description>
          <addressOffset>0x00000114</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>COUNT</name>
              <description>Counter Value</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>_3_CMPA</name>
          <displayName>PWM_3_CMPA</displayName>
          <description>PWM3 Compare A</description>
          <addressOffset>0x00000118</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>COMPA</name>
              <description>Comparator A Value</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>_3_CMPB</name>
          <displayName>PWM_3_CMPB</displayName>
          <description>PWM3 Compare B</description>
          <addressOffset>0x0000011C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>COMPB</name>
              <description>Comparator B Value</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
