m-labs/dslite2svd/svd/tm4c123x-vendor.xml
      </registers>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4ce93xh6pm/pwm.xml -->
    <peripheral derivedFrom="PWM0">
      <name>PWM1</name>
      <baseAddress>0x40029000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4ce93xh6pm/qei.xml -->
    <peripheral>
      <name>QEI0</name>
      <description>QEI register offsets</description>
      <baseAddress>0x4002C000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
      <registers>
        <register>
          <name>CTL</name>
          <displayName>QEI_CTL</displayName>
          <description>QEI Control</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable QEI</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>SWAP</name>
              <description>Swap Signals</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>SIGMODE</name>
              <description>Signal Mode</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CAPMODE</name>
              <description>Capture Mode</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RESMODE</name>
              <description>Reset Mode</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>VELEN</name>
              <description>Capture Velocity</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>VELDIV</name>
              <description>Predivide Velocity</description>
              <lsb>6</lsb>
              <msb>8</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_1</name>
                  <description>QEI clock /1</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_2</name>
                  <description>QEI clock /2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_4</name>
                  <description>QEI clock /4</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_8</name>
                  <description>QEI clock /8</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_16</name>
                  <description>QEI clock /16</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_32</name>
                  <description>QEI clock /32</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_64</name>
                  <description>QEI clock /64</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_128</name>
                  <description>QEI clock /128</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INVA</name>
              <description>Invert PhA</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INVB</name>
              <description>Invert PhB</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INVI</name>
              <description>Invert Index Pulse</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>STALLEN</name>
              <description>Stall QEI</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>FILTEN</name>
              <description>Enable Input Filter</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>FILTCNT</name>
              <description>Input Filter Prescale Count</description>
              <lsb>16</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STAT</name>
          <displayName>QEI_STAT</displayName>
          <description>QEI Status</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ERROR</name>
              <description>Error Detected</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DIRECTION</name>
              <description>Direction of Rotation</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>POS</name>
          <displayName>QEI_POS</displayName>
          <description>QEI Position</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>QEI_POS</name>
              <description>Current Position Integrator Value</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MAXPOS</name>
          <displayName>QEI_MAXPOS</displayName>
          <description>QEI Maximum Position</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>QEI_MAXPOS</name>
              <description>Maximum Position Integrator Value</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LOAD</name>
          <displayName>QEI_LOAD</displayName>
          <description>QEI Timer Load</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>QEI_LOAD</name>
              <description>Velocity Timer Load Value</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIME</name>
          <displayName>QEI_TIME</displayName>
          <description>QEI Timer</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>QEI_TIME</name>
              <description>Velocity Timer Current Value</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COUNT</name>
          <displayName>QEI_COUNT</displayName>
          <description>QEI Velocity Counter</description>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>QEI_COUNT</name>
              <description>Velocity Pulse Count</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPEED</name>
          <displayName>QEI_SPEED</displayName>
          <description>QEI Velocity</description>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>QEI_SPEED</name>
              <description>Velocity</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTEN</name>
          <displayName>QEI_INTEN</displayName>
          <description>QEI Interrupt Enable</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INDEX</name>
              <description>Index Pulse Detected Interrupt Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TIMER</name>
              <description>Timer Expires Interrupt Enable</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DIR</name>
              <description>Direction Change Interrupt Enable</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ERROR</name>
              <description>Phase Error Interrupt Enable</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>RIS</name>
          <displayName>QEI_RIS</displayName>
          <description>QEI Raw Interrupt Status</description>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INDEX</name>
              <description>Index Pulse Asserted</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TIMER</name>
              <description>Velocity Timer Expired</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DIR</name>
              <description>Direction Change Detected</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ERROR</name>
              <description>Phase Error Detected</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>ISC</name>
          <displayName>QEI_ISC</displayName>
          <description>QEI Interrupt Status and Clear</description>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INDEX</name>
              <description>Index Pulse Interrupt</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TIMER</name>
              <description>Velocity Timer Expired Interrupt</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DIR</name>
              <description>Direction Change Interrupt</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ERROR</name>
              <description>Phase Error Interrupt</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
