m-labs/dslite2svd/svd/tm4c123x-vendor.xml
        <register>
          <name>TBPV</name>
          <displayName>TIMER_TBPV</displayName>
          <description>GPTM Timer B Prescale Value</description>
          <addressOffset>0x00000068</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PSV</name>
              <description>GPTM Timer B Prescaler Value</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PP</name>
          <displayName>TIMER_PP</displayName>
          <description>GPTM Peripheral Properties</description>
          <addressOffset>0x00000FC0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SIZE</name>
              <description>Count Size</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_16</name>
                  <description>Timer A and Timer B counters are 16 bits each with an 8-bit prescale counter</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_32</name>
                  <description>Timer A and Timer B counters are 32 bits each with a 16-bit prescale counter</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4cc231e6pm/wtimer.xml -->
    <peripheral derivedFrom="WTIMER0">
      <name>WTIMER1</name>
      <baseAddress>0x40037000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4ce93xh6pm/adc.xml -->
    <peripheral>
      <name>ADC0</name>
      <description>ADC register offsets</description>
      <baseAddress>0x40038000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
      <registers>
        <register>
          <name>ACTSS</name>
          <displayName>ADC_ACTSS</displayName>
          <description>ADC Active Sample Sequencer</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ASEN0</name>
              <description>ADC SS0 Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ASEN1</name>
              <description>ADC SS1 Enable</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ASEN2</name>
              <description>ADC SS2 Enable</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ASEN3</name>
              <description>ADC SS3 Enable</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>BUSY</name>
              <description>ADC Busy</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>RIS</name>
          <displayName>ADC_RIS</displayName>
          <description>ADC Raw Interrupt Status</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INR0</name>
              <description>SS0 Raw Interrupt Status</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INR1</name>
              <description>SS1 Raw Interrupt Status</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INR2</name>
              <description>SS2 Raw Interrupt Status</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INR3</name>
              <description>SS3 Raw Interrupt Status</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INRDC</name>
              <description>Digital Comparator Raw Interrupt Status</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>IM</name>
          <displayName>ADC_IM</displayName>
          <description>ADC Interrupt Mask</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MASK0</name>
              <description>SS0 Interrupt Mask</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MASK1</name>
              <description>SS1 Interrupt Mask</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MASK2</name>
              <description>SS2 Interrupt Mask</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MASK3</name>
              <description>SS3 Interrupt Mask</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DCONSS0</name>
              <description>Digital Comparator Interrupt on SS0</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DCONSS1</name>
              <description>Digital Comparator Interrupt on SS1</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DCONSS2</name>
              <description>Digital Comparator Interrupt on SS2</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DCONSS3</name>
              <description>Digital Comparator Interrupt on SS3</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>ISC</name>
          <displayName>ADC_ISC</displayName>
          <description>ADC Interrupt Status and Clear</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>IN0</name>
              <description>SS0 Interrupt Status and Clear</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>IN1</name>
              <description>SS1 Interrupt Status and Clear</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>IN2</name>
              <description>SS2 Interrupt Status and Clear</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>IN3</name>
              <description>SS3 Interrupt Status and Clear</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DCINSS0</name>
              <description>Digital Comparator Interrupt Status on SS0</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DCINSS1</name>
              <description>Digital Comparator Interrupt Status on SS1</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DCINSS2</name>
              <description>Digital Comparator Interrupt Status on SS2</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DCINSS3</name>
              <description>Digital Comparator Interrupt Status on SS3</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>OSTAT</name>
          <displayName>ADC_OSTAT</displayName>
          <description>ADC Overflow Status</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OV0</name>
              <description>SS0 FIFO Overflow</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>OV1</name>
              <description>SS1 FIFO Overflow</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>OV2</name>
              <description>SS2 FIFO Overflow</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>OV3</name>
              <description>SS3 FIFO Overflow</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
