m-labs/dslite2svd/svd/tm4c123x-vendor.xml
        <register>
          <name>EMUX</name>
          <displayName>ADC_EMUX</displayName>
          <description>ADC Event Multiplexer Select</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EM0</name>
              <description>SS0 Trigger Select</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PROCESSOR</name>
                  <description>Processor (default)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMP0</name>
                  <description>Analog Comparator 0</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMP1</name>
                  <description>Analog Comparator 1</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTERNAL</name>
                  <description>External (GPIO Pins)</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER</name>
                  <description>Timer</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM0</name>
                  <description>PWM generator 0</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM1</name>
                  <description>PWM generator 1</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM2</name>
                  <description>PWM generator 2</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM3</name>
                  <description>PWM generator 3</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALWAYS</name>
                  <description>Always (continuously sample)</description>
                  <value>0xf</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EM1</name>
              <description>SS1 Trigger Select</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PROCESSOR</name>
                  <description>Processor (default)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMP0</name>
                  <description>Analog Comparator 0</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMP1</name>
                  <description>Analog Comparator 1</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTERNAL</name>
                  <description>External (GPIO Pins)</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER</name>
                  <description>Timer</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM0</name>
                  <description>PWM generator 0</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM1</name>
                  <description>PWM generator 1</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM2</name>
                  <description>PWM generator 2</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM3</name>
                  <description>PWM generator 3</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALWAYS</name>
                  <description>Always (continuously sample)</description>
                  <value>0xf</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EM2</name>
              <description>SS2 Trigger Select</description>
              <lsb>8</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PROCESSOR</name>
                  <description>Processor (default)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMP0</name>
                  <description>Analog Comparator 0</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMP1</name>
                  <description>Analog Comparator 1</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTERNAL</name>
                  <description>External (GPIO Pins)</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER</name>
                  <description>Timer</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM0</name>
                  <description>PWM generator 0</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM1</name>
                  <description>PWM generator 1</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM2</name>
                  <description>PWM generator 2</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM3</name>
                  <description>PWM generator 3</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALWAYS</name>
                  <description>Always (continuously sample)</description>
                  <value>0xf</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EM3</name>
              <description>SS3 Trigger Select</description>
              <lsb>12</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PROCESSOR</name>
                  <description>Processor (default)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMP0</name>
                  <description>Analog Comparator 0</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMP1</name>
                  <description>Analog Comparator 1</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTERNAL</name>
                  <description>External (GPIO Pins)</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER</name>
                  <description>Timer</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM0</name>
                  <description>PWM generator 0</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM1</name>
                  <description>PWM generator 1</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM2</name>
                  <description>PWM generator 2</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM3</name>
                  <description>PWM generator 3</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALWAYS</name>
                  <description>Always (continuously sample)</description>
                  <value>0xf</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USTAT</name>
          <displayName>ADC_USTAT</displayName>
          <description>ADC Underflow Status</description>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>UV0</name>
              <description>SS0 FIFO Underflow</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>UV1</name>
              <description>SS1 FIFO Underflow</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>UV2</name>
              <description>SS2 FIFO Underflow</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>UV3</name>
              <description>SS3 FIFO Underflow</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TSSEL</name>
          <displayName>ADC_TSSEL</displayName>
          <description>ADC Trigger Source Select</description>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PS0</name>
              <description>Generator 0 PWM Module Trigger Select</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_0</name>
                  <description>Use Generator 0 (and its trigger) in PWM module 0</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_1</name>
                  <description>Use Generator 0 (and its trigger) in PWM module 1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PS1</name>
              <description>Generator 1 PWM Module Trigger Select</description>
              <lsb>12</lsb>
              <msb>13</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_0</name>
                  <description>Use Generator 1 (and its trigger) in PWM module 0</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_1</name>
                  <description>Use Generator 1 (and its trigger) in PWM module 1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PS2</name>
              <description>Generator 2 PWM Module Trigger Select</description>
              <lsb>20</lsb>
              <msb>21</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_0</name>
                  <description>Use Generator 2 (and its trigger) in PWM module 0</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_1</name>
                  <description>Use Generator 2 (and its trigger) in PWM module 1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PS3</name>
              <description>Generator 3 PWM Module Trigger Select</description>
              <lsb>28</lsb>
              <msb>29</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_0</name>
                  <description>Use Generator 3 (and its trigger) in PWM module 0</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_1</name>
                  <description>Use Generator 3 (and its trigger) in PWM module 1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SSPRI</name>
          <displayName>ADC_SSPRI</displayName>
          <description>ADC Sample Sequencer Priority</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SS0</name>
              <description>SS0 Priority</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SS1</name>
              <description>SS1 Priority</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SS2</name>
              <description>SS2 Priority</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SS3</name>
              <description>SS3 Priority</description>
              <lsb>12</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPC</name>
          <displayName>ADC_SPC</displayName>
          <description>ADC Sample Phase Control</description>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PHASE</name>
              <description>Phase Difference</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_0</name>
                  <description>ADC sample lags by 0.0</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_22_5</name>
                  <description>ADC sample lags by 22.5</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_45</name>
                  <description>ADC sample lags by 45.0</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_67_5</name>
                  <description>ADC sample lags by 67.5</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_90</name>
                  <description>ADC sample lags by 90.0</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_112_5</name>
                  <description>ADC sample lags by 112.5</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_135</name>
                  <description>ADC sample lags by 135.0</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_157_5</name>
                  <description>ADC sample lags by 157.5</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_180</name>
                  <description>ADC sample lags by 180.0</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_202_5</name>
                  <description>ADC sample lags by 202.5</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_225</name>
                  <description>ADC sample lags by 225.0</description>
                  <value>0xa</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_247_5</name>
                  <description>ADC sample lags by 247.5</description>
                  <value>0xb</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_270</name>
                  <description>ADC sample lags by 270.0</description>
                  <value>0xc</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_292_5</name>
                  <description>ADC sample lags by 292.5</description>
                  <value>0xd</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_315</name>
                  <description>ADC sample lags by 315.0</description>
                  <value>0xe</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_337_5</name>
                  <description>ADC sample lags by 337.5</description>
                  <value>0xf</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
