m-labs/dslite2svd/svd/tm4c123x-vendor.xml
        <register>
          <name>SSCTL0</name>
          <displayName>ADC_SSCTL0</displayName>
          <description>ADC Sample Sequence Control 0</description>
          <addressOffset>0x00000044</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>D0</name>
              <description>1st Sample Differential Input Select</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>END0</name>
              <description>1st Sample is End of Sequence</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>IE0</name>
              <description>1st Sample Interrupt Enable</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TS0</name>
              <description>1st Sample Temp Sensor Select</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>D1</name>
              <description>2nd Sample Differential Input Select</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>END1</name>
              <description>2nd Sample is End of Sequence</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>IE1</name>
              <description>2nd Sample Interrupt Enable</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TS1</name>
              <description>2nd Sample Temp Sensor Select</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>D2</name>
              <description>3rd Sample Differential Input Select</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>END2</name>
              <description>3rd Sample is End of Sequence</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>IE2</name>
              <description>3rd Sample Interrupt Enable</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TS2</name>
              <description>3rd Sample Temp Sensor Select</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>D3</name>
              <description>4th Sample Differential Input Select</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>END3</name>
              <description>4th Sample is End of Sequence</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>IE3</name>
              <description>4th Sample Interrupt Enable</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TS3</name>
              <description>4th Sample Temp Sensor Select</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>D4</name>
              <description>5th Sample Differential Input Select</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>END4</name>
              <description>5th Sample is End of Sequence</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>IE4</name>
              <description>5th Sample Interrupt Enable</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TS4</name>
              <description>5th Sample Temp Sensor Select</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>D5</name>
              <description>6th Sample Differential Input Select</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>END5</name>
              <description>6th Sample is End of Sequence</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>IE5</name>
              <description>6th Sample Interrupt Enable</description>
              <lsb>22</lsb>
              <msb>22</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TS5</name>
              <description>6th Sample Temp Sensor Select</description>
              <lsb>23</lsb>
              <msb>23</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>D6</name>
              <description>7th Sample Differential Input Select</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>END6</name>
              <description>7th Sample is End of Sequence</description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>IE6</name>
              <description>7th Sample Interrupt Enable</description>
              <lsb>26</lsb>
              <msb>26</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TS6</name>
              <description>7th Sample Temp Sensor Select</description>
              <lsb>27</lsb>
              <msb>27</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>D7</name>
              <description>8th Sample Differential Input Select</description>
              <lsb>28</lsb>
              <msb>28</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>END7</name>
              <description>8th Sample is End of Sequence</description>
              <lsb>29</lsb>
              <msb>29</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>IE7</name>
              <description>8th Sample Interrupt Enable</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TS7</name>
              <description>8th Sample Temp Sensor Select</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SSFIFO0</name>
          <displayName>ADC_SSFIFO0</displayName>
          <description>ADC Sample Sequence Result FIFO 0</description>
          <addressOffset>0x00000048</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DATA</name>
              <description>Conversion Result Data</description>
              <lsb>0</lsb>
              <msb>11</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SSFSTAT0</name>
          <displayName>ADC_SSFSTAT0</displayName>
          <description>ADC Sample Sequence FIFO 0 Status</description>
          <addressOffset>0x0000004C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TPTR</name>
              <description>FIFO Tail Pointer</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>HPTR</name>
              <description>FIFO Head Pointer</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EMPTY</name>
              <description>FIFO Empty</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>FULL</name>
              <description>FIFO Full</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SSOP0</name>
          <displayName>ADC_SSOP0</displayName>
          <description>ADC Sample Sequence 0 Operation</description>
          <addressOffset>0x00000050</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>S0DCOP</name>
              <description>Sample 0 Digital Comparator Operation</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>S1DCOP</name>
              <description>Sample 1 Digital Comparator Operation</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>S2DCOP</name>
              <description>Sample 2 Digital Comparator Operation</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>S3DCOP</name>
              <description>Sample 3 Digital Comparator Operation</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>S4DCOP</name>
              <description>Sample 4 Digital Comparator Operation</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>S5DCOP</name>
              <description>Sample 5 Digital Comparator Operation</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>S6DCOP</name>
              <description>Sample 6 Digital Comparator Operation</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>S7DCOP</name>
              <description>Sample 7 Digital Comparator Operation</description>
              <lsb>28</lsb>
              <msb>28</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SSDC0</name>
          <displayName>ADC_SSDC0</displayName>
          <description>ADC Sample Sequence 0 Digital Comparator Select</description>
          <addressOffset>0x00000054</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>S0DCSEL</name>
              <description>Sample 0 Digital Comparator Select</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>S1DCSEL</name>
              <description>Sample 1 Digital Comparator Select</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>S2DCSEL</name>
              <description>Sample 2 Digital Comparator Select</description>
              <lsb>8</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>S3DCSEL</name>
              <description>Sample 3 Digital Comparator Select</description>
              <lsb>12</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>S4DCSEL</name>
              <description>Sample 4 Digital Comparator Select</description>
              <lsb>16</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>S5DCSEL</name>
              <description>Sample 5 Digital Comparator Select</description>
              <lsb>20</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>S6DCSEL</name>
              <description>Sample 6 Digital Comparator Select</description>
              <lsb>24</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>S7DCSEL</name>
              <description>Sample 7 Digital Comparator Select</description>
              <lsb>28</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SSMUX1</name>
          <displayName>ADC_SSMUX1</displayName>
          <description>ADC Sample Sequence Input Multiplexer Select 1</description>
          <addressOffset>0x00000060</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MUX0</name>
              <description>1st Sample Input Select</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX1</name>
              <description>2nd Sample Input Select</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX2</name>
              <description>3rd Sample Input Select</description>
              <lsb>8</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX3</name>
              <description>4th Sample Input Select</description>
              <lsb>12</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
