m-labs/dslite2svd/svd/tm4c123x-vendor.xml
        <register>
          <name>SSCTL1</name>
          <displayName>ADC_SSCTL1</displayName>
          <description>ADC Sample Sequence Control 1</description>
          <addressOffset>0x00000064</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>D0</name>
              <description>1st Sample Differential Input Select</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>END0</name>
              <description>1st Sample is End of Sequence</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>IE0</name>
              <description>1st Sample Interrupt Enable</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TS0</name>
              <description>1st Sample Temp Sensor Select</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>D1</name>
              <description>2nd Sample Differential Input Select</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>END1</name>
              <description>2nd Sample is End of Sequence</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>IE1</name>
              <description>2nd Sample Interrupt Enable</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TS1</name>
              <description>2nd Sample Temp Sensor Select</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>D2</name>
              <description>3rd Sample Differential Input Select</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>END2</name>
              <description>3rd Sample is End of Sequence</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>IE2</name>
              <description>3rd Sample Interrupt Enable</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TS2</name>
              <description>3rd Sample Temp Sensor Select</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>D3</name>
              <description>4th Sample Differential Input Select</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>END3</name>
              <description>4th Sample is End of Sequence</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>IE3</name>
              <description>4th Sample Interrupt Enable</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TS3</name>
              <description>4th Sample Temp Sensor Select</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SSFIFO1</name>
          <displayName>ADC_SSFIFO1</displayName>
          <description>ADC Sample Sequence Result FIFO 1</description>
          <addressOffset>0x00000068</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DATA</name>
              <description>Conversion Result Data</description>
              <lsb>0</lsb>
              <msb>11</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SSFSTAT1</name>
          <displayName>ADC_SSFSTAT1</displayName>
          <description>ADC Sample Sequence FIFO 1 Status</description>
          <addressOffset>0x0000006C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TPTR</name>
              <description>FIFO Tail Pointer</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>HPTR</name>
              <description>FIFO Head Pointer</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EMPTY</name>
              <description>FIFO Empty</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>FULL</name>
              <description>FIFO Full</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SSOP1</name>
          <displayName>ADC_SSOP1</displayName>
          <description>ADC Sample Sequence 1 Operation</description>
          <addressOffset>0x00000070</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>S0DCOP</name>
              <description>Sample 0 Digital Comparator Operation</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>S1DCOP</name>
              <description>Sample 1 Digital Comparator Operation</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>S2DCOP</name>
              <description>Sample 2 Digital Comparator Operation</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>S3DCOP</name>
              <description>Sample 3 Digital Comparator Operation</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SSDC1</name>
          <displayName>ADC_SSDC1</displayName>
          <description>ADC Sample Sequence 1 Digital Comparator Select</description>
          <addressOffset>0x00000074</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>S0DCSEL</name>
              <description>Sample 0 Digital Comparator Select</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>S1DCSEL</name>
              <description>Sample 1 Digital Comparator Select</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>S2DCSEL</name>
              <description>Sample 2 Digital Comparator Select</description>
              <lsb>8</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>S3DCSEL</name>
              <description>Sample 3 Digital Comparator Select</description>
              <lsb>12</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SSMUX2</name>
          <displayName>ADC_SSMUX2</displayName>
          <description>ADC Sample Sequence Input Multiplexer Select 2</description>
          <addressOffset>0x00000080</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MUX0</name>
              <description>1st Sample Input Select</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX1</name>
              <description>2nd Sample Input Select</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX2</name>
              <description>3rd Sample Input Select</description>
              <lsb>8</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX3</name>
              <description>4th Sample Input Select</description>
              <lsb>12</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SSCTL2</name>
          <displayName>ADC_SSCTL2</displayName>
          <description>ADC Sample Sequence Control 2</description>
          <addressOffset>0x00000084</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>D0</name>
              <description>1st Sample Differential Input Select</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>END0</name>
              <description>1st Sample is End of Sequence</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>IE0</name>
              <description>1st Sample Interrupt Enable</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TS0</name>
              <description>1st Sample Temp Sensor Select</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>D1</name>
              <description>2nd Sample Differential Input Select</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>END1</name>
              <description>2nd Sample is End of Sequence</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>IE1</name>
              <description>2nd Sample Interrupt Enable</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TS1</name>
              <description>2nd Sample Temp Sensor Select</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>D2</name>
              <description>3rd Sample Differential Input Select</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>END2</name>
              <description>3rd Sample is End of Sequence</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>IE2</name>
              <description>3rd Sample Interrupt Enable</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TS2</name>
              <description>3rd Sample Temp Sensor Select</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>D3</name>
              <description>4th Sample Differential Input Select</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>END3</name>
              <description>4th Sample is End of Sequence</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>IE3</name>
              <description>4th Sample Interrupt Enable</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TS3</name>
              <description>4th Sample Temp Sensor Select</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SSFIFO2</name>
          <displayName>ADC_SSFIFO2</displayName>
          <description>ADC Sample Sequence Result FIFO 2</description>
          <addressOffset>0x00000088</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DATA</name>
              <description>Conversion Result Data</description>
              <lsb>0</lsb>
              <msb>11</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SSFSTAT2</name>
          <displayName>ADC_SSFSTAT2</displayName>
          <description>ADC Sample Sequence FIFO 2 Status</description>
          <addressOffset>0x0000008C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TPTR</name>
              <description>FIFO Tail Pointer</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>HPTR</name>
              <description>FIFO Head Pointer</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EMPTY</name>
              <description>FIFO Empty</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>FULL</name>
              <description>FIFO Full</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
