m-labs/dslite2svd/svd/tm4c123x-vendor.xml
        <register>
          <name>SSOP2</name>
          <displayName>ADC_SSOP2</displayName>
          <description>ADC Sample Sequence 2 Operation</description>
          <addressOffset>0x00000090</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>S0DCOP</name>
              <description>Sample 0 Digital Comparator Operation</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>S1DCOP</name>
              <description>Sample 1 Digital Comparator Operation</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>S2DCOP</name>
              <description>Sample 2 Digital Comparator Operation</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>S3DCOP</name>
              <description>Sample 3 Digital Comparator Operation</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SSDC2</name>
          <displayName>ADC_SSDC2</displayName>
          <description>ADC Sample Sequence 2 Digital Comparator Select</description>
          <addressOffset>0x00000094</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>S0DCSEL</name>
              <description>Sample 0 Digital Comparator Select</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>S1DCSEL</name>
              <description>Sample 1 Digital Comparator Select</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>S2DCSEL</name>
              <description>Sample 2 Digital Comparator Select</description>
              <lsb>8</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>S3DCSEL</name>
              <description>Sample 3 Digital Comparator Select</description>
              <lsb>12</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SSMUX3</name>
          <displayName>ADC_SSMUX3</displayName>
          <description>ADC Sample Sequence Input Multiplexer Select 3</description>
          <addressOffset>0x000000A0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MUX0</name>
              <description>1st Sample Input Select</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SSCTL3</name>
          <displayName>ADC_SSCTL3</displayName>
          <description>ADC Sample Sequence Control 3</description>
          <addressOffset>0x000000A4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>D0</name>
              <description>Sample Differential Input Select</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>END0</name>
              <description>End of Sequence</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>IE0</name>
              <description>Sample Interrupt Enable</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TS0</name>
              <description>1st Sample Temp Sensor Select</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SSFIFO3</name>
          <displayName>ADC_SSFIFO3</displayName>
          <description>ADC Sample Sequence Result FIFO 3</description>
          <addressOffset>0x000000A8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DATA</name>
              <description>Conversion Result Data</description>
              <lsb>0</lsb>
              <msb>11</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SSFSTAT3</name>
          <displayName>ADC_SSFSTAT3</displayName>
          <description>ADC Sample Sequence FIFO 3 Status</description>
          <addressOffset>0x000000AC</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TPTR</name>
              <description>FIFO Tail Pointer</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>HPTR</name>
              <description>FIFO Head Pointer</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EMPTY</name>
              <description>FIFO Empty</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>FULL</name>
              <description>FIFO Full</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SSOP3</name>
          <displayName>ADC_SSOP3</displayName>
          <description>ADC Sample Sequence 3 Operation</description>
          <addressOffset>0x000000B0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>S0DCOP</name>
              <description>Sample 0 Digital Comparator Operation</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SSDC3</name>
          <displayName>ADC_SSDC3</displayName>
          <description>ADC Sample Sequence 3 Digital Comparator Select</description>
          <addressOffset>0x000000B4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>S0DCSEL</name>
              <description>Sample 0 Digital Comparator Select</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCRIC</name>
          <displayName>ADC_DCRIC</displayName>
          <description>ADC Digital Comparator Reset Initial Conditions</description>
          <addressOffset>0x00000D00</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DCINT0</name>
              <description>Digital Comparator Interrupt 0</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>write-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DCINT1</name>
              <description>Digital Comparator Interrupt 1</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>write-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DCINT2</name>
              <description>Digital Comparator Interrupt 2</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>write-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DCINT3</name>
              <description>Digital Comparator Interrupt 3</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>write-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DCINT4</name>
              <description>Digital Comparator Interrupt 4</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>write-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DCINT5</name>
              <description>Digital Comparator Interrupt 5</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>write-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DCINT6</name>
              <description>Digital Comparator Interrupt 6</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>write-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DCINT7</name>
              <description>Digital Comparator Interrupt 7</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>write-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DCTRIG0</name>
              <description>Digital Comparator Trigger 0</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>write-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DCTRIG1</name>
              <description>Digital Comparator Trigger 1</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>write-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DCTRIG2</name>
              <description>Digital Comparator Trigger 2</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>write-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DCTRIG3</name>
              <description>Digital Comparator Trigger 3</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>write-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DCTRIG4</name>
              <description>Digital Comparator Trigger 4</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>write-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DCTRIG5</name>
              <description>Digital Comparator Trigger 5</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>write-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DCTRIG6</name>
              <description>Digital Comparator Trigger 6</description>
              <lsb>22</lsb>
              <msb>22</msb>
              <access>write-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DCTRIG7</name>
              <description>Digital Comparator Trigger 7</description>
              <lsb>23</lsb>
              <msb>23</msb>
              <access>write-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DCCTL0</name>
          <displayName>ADC_DCCTL0</displayName>
          <description>ADC Digital Comparator Control 0</description>
          <addressOffset>0x00000E00</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CIM</name>
              <description>Comparison Interrupt Mode</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALWAYS</name>
                  <description>Always</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONCE</name>
                  <description>Once</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HALWAYS</name>
                  <description>Hysteresis Always</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HONCE</name>
                  <description>Hysteresis Once</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CIC</name>
              <description>Comparison Interrupt Condition</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low Band</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MID</name>
                  <description>Mid Band</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>High Band</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CIE</name>
              <description>Comparison Interrupt Enable</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CTM</name>
              <description>Comparison Trigger Mode</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALWAYS</name>
                  <description>Always</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONCE</name>
                  <description>Once</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HALWAYS</name>
                  <description>Hysteresis Always</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HONCE</name>
                  <description>Hysteresis Once</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTC</name>
              <description>Comparison Trigger Condition</description>
              <lsb>10</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low Band</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MID</name>
                  <description>Mid Band</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>High Band</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTE</name>
              <description>Comparison Trigger Enable</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
