m-labs/dslite2svd/svd/tm4c123x-vendor.xml
        <register>
          <name>DCCTL5</name>
          <displayName>ADC_DCCTL5</displayName>
          <description>ADC Digital Comparator Control 5</description>
          <addressOffset>0x00000E14</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CIM</name>
              <description>Comparison Interrupt Mode</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALWAYS</name>
                  <description>Always</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONCE</name>
                  <description>Once</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HALWAYS</name>
                  <description>Hysteresis Always</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HONCE</name>
                  <description>Hysteresis Once</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CIC</name>
              <description>Comparison Interrupt Condition</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low Band</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MID</name>
                  <description>Mid Band</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>High Band</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CIE</name>
              <description>Comparison Interrupt Enable</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CTM</name>
              <description>Comparison Trigger Mode</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALWAYS</name>
                  <description>Always</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONCE</name>
                  <description>Once</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HALWAYS</name>
                  <description>Hysteresis Always</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HONCE</name>
                  <description>Hysteresis Once</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTC</name>
              <description>Comparison Trigger Condition</description>
              <lsb>10</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low Band</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MID</name>
                  <description>Mid Band</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>High Band</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTE</name>
              <description>Comparison Trigger Enable</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DCCTL6</name>
          <displayName>ADC_DCCTL6</displayName>
          <description>ADC Digital Comparator Control 6</description>
          <addressOffset>0x00000E18</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CIM</name>
              <description>Comparison Interrupt Mode</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALWAYS</name>
                  <description>Always</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONCE</name>
                  <description>Once</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HALWAYS</name>
                  <description>Hysteresis Always</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HONCE</name>
                  <description>Hysteresis Once</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CIC</name>
              <description>Comparison Interrupt Condition</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low Band</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MID</name>
                  <description>Mid Band</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>High Band</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CIE</name>
              <description>Comparison Interrupt Enable</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CTM</name>
              <description>Comparison Trigger Mode</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALWAYS</name>
                  <description>Always</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONCE</name>
                  <description>Once</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HALWAYS</name>
                  <description>Hysteresis Always</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HONCE</name>
                  <description>Hysteresis Once</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTC</name>
              <description>Comparison Trigger Condition</description>
              <lsb>10</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low Band</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MID</name>
                  <description>Mid Band</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>High Band</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTE</name>
              <description>Comparison Trigger Enable</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DCCTL7</name>
          <displayName>ADC_DCCTL7</displayName>
          <description>ADC Digital Comparator Control 7</description>
          <addressOffset>0x00000E1C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CIM</name>
              <description>Comparison Interrupt Mode</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALWAYS</name>
                  <description>Always</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONCE</name>
                  <description>Once</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HALWAYS</name>
                  <description>Hysteresis Always</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HONCE</name>
                  <description>Hysteresis Once</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CIC</name>
              <description>Comparison Interrupt Condition</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low Band</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MID</name>
                  <description>Mid Band</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>High Band</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CIE</name>
              <description>Comparison Interrupt Enable</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CTM</name>
              <description>Comparison Trigger Mode</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALWAYS</name>
                  <description>Always</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONCE</name>
                  <description>Once</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HALWAYS</name>
                  <description>Hysteresis Always</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HONCE</name>
                  <description>Hysteresis Once</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTC</name>
              <description>Comparison Trigger Condition</description>
              <lsb>10</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low Band</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MID</name>
                  <description>Mid Band</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>High Band</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTE</name>
              <description>Comparison Trigger Enable</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DCCMP0</name>
          <displayName>ADC_DCCMP0</displayName>
          <description>ADC Digital Comparator Range 0</description>
          <addressOffset>0x00000E40</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>COMP0</name>
              <description>Compare 0</description>
              <lsb>0</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>COMP1</name>
              <description>Compare 1</description>
              <lsb>16</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCCMP1</name>
          <displayName>ADC_DCCMP1</displayName>
          <description>ADC Digital Comparator Range 1</description>
          <addressOffset>0x00000E44</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>COMP0</name>
              <description>Compare 0</description>
              <lsb>0</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>COMP1</name>
              <description>Compare 1</description>
              <lsb>16</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCCMP2</name>
          <displayName>ADC_DCCMP2</displayName>
          <description>ADC Digital Comparator Range 2</description>
          <addressOffset>0x00000E48</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>COMP0</name>
              <description>Compare 0</description>
              <lsb>0</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>COMP1</name>
              <description>Compare 1</description>
              <lsb>16</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCCMP3</name>
          <displayName>ADC_DCCMP3</displayName>
          <description>ADC Digital Comparator Range 3</description>
          <addressOffset>0x00000E4C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>COMP0</name>
              <description>Compare 0</description>
              <lsb>0</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>COMP1</name>
              <description>Compare 1</description>
              <lsb>16</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCCMP4</name>
          <displayName>ADC_DCCMP4</displayName>
          <description>ADC Digital Comparator Range 4</description>
          <addressOffset>0x00000E50</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>COMP0</name>
              <description>Compare 0</description>
              <lsb>0</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>COMP1</name>
              <description>Compare 1</description>
              <lsb>16</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCCMP5</name>
          <displayName>ADC_DCCMP5</displayName>
          <description>ADC Digital Comparator Range 5</description>
          <addressOffset>0x00000E54</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>COMP0</name>
              <description>Compare 0</description>
              <lsb>0</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>COMP1</name>
              <description>Compare 1</description>
              <lsb>16</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCCMP6</name>
          <displayName>ADC_DCCMP6</displayName>
          <description>ADC Digital Comparator Range 6</description>
          <addressOffset>0x00000E58</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>COMP0</name>
              <description>Compare 0</description>
              <lsb>0</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>COMP1</name>
              <description>Compare 1</description>
              <lsb>16</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCCMP7</name>
          <displayName>ADC_DCCMP7</displayName>
          <description>ADC Digital Comparator Range 7</description>
          <addressOffset>0x00000E5C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>COMP0</name>
              <description>Compare 0</description>
              <lsb>0</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>COMP1</name>
              <description>Compare 1</description>
              <lsb>16</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
