m-labs/dslite2svd/svd/tm4c123x-vendor.xml
        <register>
          <name>PP</name>
          <displayName>ADC_PP</displayName>
          <description>ADC Peripheral Properties</description>
          <addressOffset>0x00000FC0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MSR</name>
              <description>Maximum ADC Sample Rate</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_125K</name>
                  <description>125 ksps</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_250K</name>
                  <description>250 ksps</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_500K</name>
                  <description>500 ksps</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_1M</name>
                  <description>1 Msps</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH</name>
              <description>ADC Channel Count</description>
              <lsb>4</lsb>
              <msb>9</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DC</name>
              <description>Digital Comparator Count</description>
              <lsb>10</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>TYPE</name>
              <description>ADC Architecture</description>
              <lsb>16</lsb>
              <msb>17</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SAR</name>
                  <description>SAR</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RSL</name>
              <description>Resolution</description>
              <lsb>18</lsb>
              <msb>22</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>TS</name>
              <description>Temperature Sensor</description>
              <lsb>23</lsb>
              <msb>23</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PC</name>
          <displayName>ADC_PC</displayName>
          <description>ADC Peripheral Configuration</description>
          <addressOffset>0x00000FC4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SR</name>
              <description>ADC Sample Rate</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_125K</name>
                  <description>125 ksps</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_250K</name>
                  <description>250 ksps</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_500K</name>
                  <description>500 ksps</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_1M</name>
                  <description>1 Msps</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CC</name>
          <displayName>ADC_CC</displayName>
          <description>ADC Clock Configuration</description>
          <addressOffset>0x00000FC8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CS</name>
              <description>ADC Clock Source</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSPLL</name>
                  <description>PLL VCO divided by CLKDIV</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIOSC</name>
                  <description>PIOSC</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4ce93xh6pm/adc.xml -->
    <peripheral derivedFrom="ADC0">
      <name>ADC1</name>
      <baseAddress>0x40039000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4cc231e6pm/comp.xml -->
    <peripheral>
      <name>COMP</name>
      <description>Comparator register offsets</description>
      <baseAddress>0x4003C000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
      <registers>
        <register>
          <name>ACMIS</name>
          <displayName>COMP_ACMIS</displayName>
          <description>Analog Comparator Masked Interrupt Status</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>IN0</name>
              <description>Comparator 0 Masked Interrupt Status</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>IN1</name>
              <description>Comparator 1 Masked Interrupt Status</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>ACRIS</name>
          <displayName>COMP_ACRIS</displayName>
          <description>Analog Comparator Raw Interrupt Status</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>IN0</name>
              <description>Comparator 0 Interrupt Status</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>IN1</name>
              <description>Comparator 1 Interrupt Status</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>ACINTEN</name>
          <displayName>COMP_ACINTEN</displayName>
          <description>Analog Comparator Interrupt Enable</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>IN0</name>
              <description>Comparator 0 Interrupt Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>IN1</name>
              <description>Comparator 1 Interrupt Enable</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>ACREFCTL</name>
          <displayName>COMP_ACREFCTL</displayName>
          <description>Analog Comparator Reference Voltage Control</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>VREF</name>
              <description>Resistor Ladder Voltage Ref</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RNG</name>
              <description>Resistor Ladder Range</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>EN</name>
              <description>Resistor Ladder Enable</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>ACSTAT0</name>
          <displayName>COMP_ACSTAT0</displayName>
          <description>Analog Comparator Status 0</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OVAL</name>
              <description>Comparator Output Value</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>ACCTL0</name>
          <displayName>COMP_ACCTL0</displayName>
          <description>Analog Comparator Control 0</description>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CINV</name>
              <description>Comparator Output Invert</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ISEN</name>
              <description>Interrupt Sense</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LEVEL</name>
                  <description>Level sense, see ISLVAL</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALL</name>
                  <description>Falling edge</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISE</name>
                  <description>Rising edge</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOTH</name>
                  <description>Either edge</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ISLVAL</name>
              <description>Interrupt Sense Level Value</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TSEN</name>
              <description>Trigger Sense</description>
              <lsb>5</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LEVEL</name>
                  <description>Level sense, see TSLVAL</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALL</name>
                  <description>Falling edge</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISE</name>
                  <description>Rising edge</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOTH</name>
                  <description>Either edge</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TSLVAL</name>
              <description>Trigger Sense Level Value</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ASRCP</name>
              <description>Analog Source Positive</description>
              <lsb>9</lsb>
              <msb>10</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PIN</name>
                  <description>Pin value of Cn+</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIN0</name>
                  <description>Pin value of C0+</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REF</name>
                  <description>Internal voltage reference</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TOEN</name>
              <description>Trigger Output Enable</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>ACSTAT1</name>
          <displayName>COMP_ACSTAT1</displayName>
          <description>Analog Comparator Status 1</description>
          <addressOffset>0x00000040</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OVAL</name>
              <description>Comparator Output Value</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
