m-labs/dslite2svd/svd/tm4c123x-vendor.xml
        <register>
          <name>IF1ARB2</name>
          <displayName>CAN_IF1ARB2</displayName>
          <description>CAN IF1 Arbitration 2</description>
          <addressOffset>0x00000034</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ID</name>
              <description>Message Identifier</description>
              <lsb>0</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DIR</name>
              <description>Message Direction</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>XTD</name>
              <description>Extended Identifier</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MSGVAL</name>
              <description>Message Valid</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>IF1MCTL</name>
          <displayName>CAN_IF1MCTL</displayName>
          <description>CAN IF1 Message Control</description>
          <addressOffset>0x00000038</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DLC</name>
              <description>Data Length Code</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EOB</name>
              <description>End of Buffer</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TXRQST</name>
              <description>Transmit Request</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RMTEN</name>
              <description>Remote Enable</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RXIE</name>
              <description>Receive Interrupt Enable</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TXIE</name>
              <description>Transmit Interrupt Enable</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>UMASK</name>
              <description>Use Acceptance Mask</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INTPND</name>
              <description>Interrupt Pending</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MSGLST</name>
              <description>Message Lost</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>NEWDAT</name>
              <description>New Data</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>IF1DA1</name>
          <displayName>CAN_IF1DA1</displayName>
          <description>CAN IF1 Data A1</description>
          <addressOffset>0x0000003C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DATA</name>
              <description>Data</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IF1DA2</name>
          <displayName>CAN_IF1DA2</displayName>
          <description>CAN IF1 Data A2</description>
          <addressOffset>0x00000040</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DATA</name>
              <description>Data</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IF1DB1</name>
          <displayName>CAN_IF1DB1</displayName>
          <description>CAN IF1 Data B1</description>
          <addressOffset>0x00000044</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DATA</name>
              <description>Data</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IF1DB2</name>
          <displayName>CAN_IF1DB2</displayName>
          <description>CAN IF1 Data B2</description>
          <addressOffset>0x00000048</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DATA</name>
              <description>Data</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IF2CRQ</name>
          <displayName>CAN_IF2CRQ</displayName>
          <description>CAN IF2 Command Request</description>
          <addressOffset>0x00000080</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MNUM</name>
              <description>Message Number</description>
              <lsb>0</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>BUSY</name>
              <description>Busy Flag</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>IF2CMSK</name>
          <displayName>CAN_IF2CMSK</displayName>
          <description>CAN IF2 Command Mask</description>
          <addressOffset>0x00000084</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DATAB</name>
              <description>Access Data Byte 4 to 7</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DATAA</name>
              <description>Access Data Byte 0 to 3</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>NEWDAT</name>
              <description>Access New Data</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TXRQST</name>
              <description>Access Transmission Request</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CLRINTPND</name>
              <description>Clear Interrupt Pending Bit</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CONTROL</name>
              <description>Access Control Bits</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ARB</name>
              <description>Access Arbitration Bits</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MASK</name>
              <description>Access Mask Bits</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>WRNRD</name>
              <description>Write, Not Read</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>IF2MSK1</name>
          <displayName>CAN_IF2MSK1</displayName>
          <description>CAN IF2 Mask 1</description>
          <addressOffset>0x00000088</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>IDMSK</name>
              <description>Identifier Mask</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IF2MSK2</name>
          <displayName>CAN_IF2MSK2</displayName>
          <description>CAN IF2 Mask 2</description>
          <addressOffset>0x0000008C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>IDMSK</name>
              <description>Identifier Mask</description>
              <lsb>0</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>MDIR</name>
              <description>Mask Message Direction</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MXTD</name>
              <description>Mask Extended Identifier</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>IF2ARB1</name>
          <displayName>CAN_IF2ARB1</displayName>
          <description>CAN IF2 Arbitration 1</description>
          <addressOffset>0x00000090</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ID</name>
              <description>Message Identifier</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IF2ARB2</name>
          <displayName>CAN_IF2ARB2</displayName>
          <description>CAN IF2 Arbitration 2</description>
          <addressOffset>0x00000094</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ID</name>
              <description>Message Identifier</description>
              <lsb>0</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DIR</name>
              <description>Message Direction</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>XTD</name>
              <description>Extended Identifier</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MSGVAL</name>
              <description>Message Valid</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>IF2MCTL</name>
          <displayName>CAN_IF2MCTL</displayName>
          <description>CAN IF2 Message Control</description>
          <addressOffset>0x00000098</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DLC</name>
              <description>Data Length Code</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EOB</name>
              <description>End of Buffer</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TXRQST</name>
              <description>Transmit Request</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RMTEN</name>
              <description>Remote Enable</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RXIE</name>
              <description>Receive Interrupt Enable</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TXIE</name>
              <description>Transmit Interrupt Enable</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>UMASK</name>
              <description>Use Acceptance Mask</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INTPND</name>
              <description>Interrupt Pending</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MSGLST</name>
              <description>Message Lost</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>NEWDAT</name>
              <description>New Data</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>IF2DA1</name>
          <displayName>CAN_IF2DA1</displayName>
          <description>CAN IF2 Data A1</description>
          <addressOffset>0x0000009C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DATA</name>
              <description>Data</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IF2DA2</name>
          <displayName>CAN_IF2DA2</displayName>
          <description>CAN IF2 Data A2</description>
          <addressOffset>0x000000A0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DATA</name>
              <description>Data</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IF2DB1</name>
          <displayName>CAN_IF2DB1</displayName>
          <description>CAN IF2 Data B1</description>
          <addressOffset>0x000000A4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DATA</name>
              <description>Data</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IF2DB2</name>
          <displayName>CAN_IF2DB2</displayName>
          <description>CAN IF2 Data B2</description>
          <addressOffset>0x000000A8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DATA</name>
              <description>Data</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
