m-labs/dslite2svd/svd/tm4c123x-vendor.xml
        <register>
          <name>TXRQ1</name>
          <displayName>CAN_TXRQ1</displayName>
          <description>CAN Transmission Request 1</description>
          <addressOffset>0x00000100</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TXRQST</name>
              <description>Transmission Request Bits</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TXRQ2</name>
          <displayName>CAN_TXRQ2</displayName>
          <description>CAN Transmission Request 2</description>
          <addressOffset>0x00000104</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TXRQST</name>
              <description>Transmission Request Bits</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NWDA1</name>
          <displayName>CAN_NWDA1</displayName>
          <description>CAN New Data 1</description>
          <addressOffset>0x00000120</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>NEWDAT</name>
              <description>New Data Bits</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NWDA2</name>
          <displayName>CAN_NWDA2</displayName>
          <description>CAN New Data 2</description>
          <addressOffset>0x00000124</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>NEWDAT</name>
              <description>New Data Bits</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MSG1INT</name>
          <displayName>CAN_MSG1INT</displayName>
          <description>CAN Message 1 Interrupt Pending</description>
          <addressOffset>0x00000140</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INTPND</name>
              <description>Interrupt Pending Bits</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MSG2INT</name>
          <displayName>CAN_MSG2INT</displayName>
          <description>CAN Message 2 Interrupt Pending</description>
          <addressOffset>0x00000144</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INTPND</name>
              <description>Interrupt Pending Bits</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MSG1VAL</name>
          <displayName>CAN_MSG1VAL</displayName>
          <description>CAN Message 1 Valid</description>
          <addressOffset>0x00000160</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MSGVAL</name>
              <description>Message Valid Bits</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MSG2VAL</name>
          <displayName>CAN_MSG2VAL</displayName>
          <description>CAN Message 2 Valid</description>
          <addressOffset>0x00000164</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MSGVAL</name>
              <description>Message Valid Bits</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4cc231e6pm/can.xml -->
    <peripheral derivedFrom="CAN0">
      <name>CAN1</name>
      <baseAddress>0x40041000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4cc231e6pm/wtimer.xml -->
    <peripheral derivedFrom="WTIMER0">
      <name>WTIMER2</name>
      <baseAddress>0x4004C000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4cc231e6pm/wtimer.xml -->
    <peripheral derivedFrom="WTIMER0">
      <name>WTIMER3</name>
      <baseAddress>0x4004D000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4cc231e6pm/wtimer.xml -->
    <peripheral derivedFrom="WTIMER0">
      <name>WTIMER4</name>
      <baseAddress>0x4004E000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4cc231e6pm/wtimer.xml -->
    <peripheral derivedFrom="WTIMER0">
      <name>WTIMER5</name>
      <baseAddress>0x4004F000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4ce93xh6pm/usb.xml -->
    <peripheral>
      <name>USB0</name>
      <description>Univeral Serial Bus register offsets</description>
      <baseAddress>0x40050000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
      <registers>
        <register>
          <name>FADDR</name>
          <displayName>USB_FADDR</displayName>
          <description>USB Device Functional Address</description>
          <addressOffset>0x00000000</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_FADDR</name>
              <description>Function Address</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>POWER</name>
          <displayName>USB_POWER</displayName>
          <description>USB Power</description>
          <addressOffset>0x00000001</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>PWRDNPHY</name>
              <description>Power Down PHY</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>SUSPEND</name>
              <description>SUSPEND Mode</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RESUME</name>
              <description>RESUME Signaling</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RESET</name>
              <description>RESET Signaling</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>SOFTCONN</name>
              <description>Soft Connect/Disconnect</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ISOUP</name>
              <description>Isochronous Update</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TXIS</name>
          <displayName>USB_TXIS</displayName>
          <description>USB Transmit Interrupt Status</description>
          <addressOffset>0x00000002</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>EP0</name>
              <description>TX and RX Endpoint 0 Interrupt</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>EP1</name>
              <description>TX Endpoint 1 Interrupt</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>EP2</name>
              <description>TX Endpoint 2 Interrupt</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>EP3</name>
              <description>TX Endpoint 3 Interrupt</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>EP4</name>
              <description>TX Endpoint 4 Interrupt</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>EP5</name>
              <description>TX Endpoint 5 Interrupt</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>EP6</name>
              <description>TX Endpoint 6 Interrupt</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>EP7</name>
              <description>TX Endpoint 7 Interrupt</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>RXIS</name>
          <displayName>USB_RXIS</displayName>
          <description>USB Receive Interrupt Status</description>
          <addressOffset>0x00000004</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>EP1</name>
              <description>RX Endpoint 1 Interrupt</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>EP2</name>
              <description>RX Endpoint 2 Interrupt</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>EP3</name>
              <description>RX Endpoint 3 Interrupt</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>EP4</name>
              <description>RX Endpoint 4 Interrupt</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>EP5</name>
              <description>RX Endpoint 5 Interrupt</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>EP6</name>
              <description>RX Endpoint 6 Interrupt</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>EP7</name>
              <description>RX Endpoint 7 Interrupt</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TXIE</name>
          <displayName>USB_TXIE</displayName>
          <description>USB Transmit Interrupt Enable</description>
          <addressOffset>0x00000006</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>EP0</name>
              <description>TX and RX Endpoint 0 Interrupt Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>EP1</name>
              <description>TX Endpoint 1 Interrupt Enable</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>EP2</name>
              <description>TX Endpoint 2 Interrupt Enable</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>EP3</name>
              <description>TX Endpoint 3 Interrupt Enable</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>EP4</name>
              <description>TX Endpoint 4 Interrupt Enable</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>EP5</name>
              <description>TX Endpoint 5 Interrupt Enable</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>EP6</name>
              <description>TX Endpoint 6 Interrupt Enable</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>EP7</name>
              <description>TX Endpoint 7 Interrupt Enable</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>RXIE</name>
          <displayName>USB_RXIE</displayName>
          <description>USB Receive Interrupt Enable</description>
          <addressOffset>0x00000008</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>EP1</name>
              <description>RX Endpoint 1 Interrupt Enable</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>EP2</name>
              <description>RX Endpoint 2 Interrupt Enable</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>EP3</name>
              <description>RX Endpoint 3 Interrupt Enable</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>EP4</name>
              <description>RX Endpoint 4 Interrupt Enable</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>EP5</name>
              <description>RX Endpoint 5 Interrupt Enable</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>EP6</name>
              <description>RX Endpoint 6 Interrupt Enable</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>EP7</name>
              <description>RX Endpoint 7 Interrupt Enable</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
