m-labs/dslite2svd/svd/tm4c123x-vendor.xml
        <register>
          <name>IS</name>
          <displayName>USB_IS</displayName>
          <description>USB General Interrupt Status</description>
          <addressOffset>0x0000000A</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>SUSPEND</name>
              <description>SUSPEND Signaling Detected</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RESUME</name>
              <description>RESUME Signaling Detected</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>BABBLE</name>
              <description>Babble Detected</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RESET</name>
              <description>RESET Signaling Detected</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>SOF</name>
              <description>Start of Frame</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CONN</name>
              <description>Session Connect</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DISCON</name>
              <description>Session Disconnect (OTG only)</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>SESREQ</name>
              <description>SESSION REQUEST (OTG only)</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>VBUSERR</name>
              <description>VBUS Error (OTG only)</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>IE</name>
          <displayName>USB_IE</displayName>
          <description>USB Interrupt Enable</description>
          <addressOffset>0x0000000B</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>SUSPND</name>
              <description>Enable SUSPEND Interrupt</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RESUME</name>
              <description>Enable RESUME Interrupt</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>BABBLE</name>
              <description>Enable Babble Interrupt</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RESET</name>
              <description>Enable RESET Interrupt</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>SOF</name>
              <description>Enable Start-of-Frame Interrupt</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CONN</name>
              <description>Enable Connect Interrupt</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DISCON</name>
              <description>Enable Disconnect Interrupt</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>SESREQ</name>
              <description>Enable Session Request (OTG only)</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>VBUSERR</name>
              <description>Enable VBUS Error Interrupt (OTG only)</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>FRAME</name>
          <displayName>USB_FRAME</displayName>
          <description>USB Frame Value</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_FRAME</name>
              <description>Frame Number</description>
              <lsb>0</lsb>
              <msb>10</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EPIDX</name>
          <displayName>USB_EPIDX</displayName>
          <description>USB Endpoint Index</description>
          <addressOffset>0x0000000E</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>EPIDX</name>
              <description>Endpoint Index</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TEST</name>
          <displayName>USB_TEST</displayName>
          <description>USB Test Mode</description>
          <addressOffset>0x0000000F</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FORCEFS</name>
              <description>Force Full-Speed Mode</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>FIFOACC</name>
              <description>FIFO Access</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>FORCEH</name>
              <description>Force Host Mode</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>FIFO0</name>
          <displayName>USB_FIFO0</displayName>
          <description>USB FIFO Endpoint 0</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EPDATA</name>
              <description>Endpoint Data</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FIFO1</name>
          <displayName>USB_FIFO1</displayName>
          <description>USB FIFO Endpoint 1</description>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EPDATA</name>
              <description>Endpoint Data</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FIFO2</name>
          <displayName>USB_FIFO2</displayName>
          <description>USB FIFO Endpoint 2</description>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EPDATA</name>
              <description>Endpoint Data</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FIFO3</name>
          <displayName>USB_FIFO3</displayName>
          <description>USB FIFO Endpoint 3</description>
          <addressOffset>0x0000002C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EPDATA</name>
              <description>Endpoint Data</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FIFO4</name>
          <displayName>USB_FIFO4</displayName>
          <description>USB FIFO Endpoint 4</description>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EPDATA</name>
              <description>Endpoint Data</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FIFO5</name>
          <displayName>USB_FIFO5</displayName>
          <description>USB FIFO Endpoint 5</description>
          <addressOffset>0x00000034</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EPDATA</name>
              <description>Endpoint Data</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FIFO6</name>
          <displayName>USB_FIFO6</displayName>
          <description>USB FIFO Endpoint 6</description>
          <addressOffset>0x00000038</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EPDATA</name>
              <description>Endpoint Data</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FIFO7</name>
          <displayName>USB_FIFO7</displayName>
          <description>USB FIFO Endpoint 7</description>
          <addressOffset>0x0000003C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EPDATA</name>
              <description>Endpoint Data</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DEVCTL</name>
          <displayName>USB_DEVCTL</displayName>
          <description>USB Device Control</description>
          <addressOffset>0x00000060</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>SESSION</name>
              <description>Session Start/End (OTG only)</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>HOSTREQ</name>
              <description>Host Request (OTG only)</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>HOST</name>
              <description>Host Mode</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>VBUS</name>
              <description>VBUS Level (OTG only)</description>
              <lsb>3</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Below SessionEnd</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEND</name>
                  <description>Above SessionEnd, below AValid</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVALID</name>
                  <description>Above AValid, below VBUSValid</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALID</name>
                  <description>Above VBUSValid</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LSDEV</name>
              <description>Low-Speed Device Detected</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>FSDEV</name>
              <description>Full-Speed Device Detected</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DEV</name>
              <description>Device Mode (OTG only)</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TXFIFOSZ</name>
          <displayName>USB_TXFIFOSZ</displayName>
          <description>USB Transmit Dynamic FIFO Sizing</description>
          <addressOffset>0x00000062</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>SIZE</name>
              <description>Max Packet Size</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_8</name>
                  <description>8</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_16</name>
                  <description>16</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_32</name>
                  <description>32</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_64</name>
                  <description>64</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_128</name>
                  <description>128</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_256</name>
                  <description>256</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_512</name>
                  <description>512</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_1024</name>
                  <description>1024</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_2048</name>
                  <description>2048</description>
                  <value>0x8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DPB</name>
              <description>Double Packet Buffer Support</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
