m-labs/dslite2svd/svd/tm4c123x-vendor.xml
        <register>
          <name>RXFIFOSZ</name>
          <displayName>USB_RXFIFOSZ</displayName>
          <description>USB Receive Dynamic FIFO Sizing</description>
          <addressOffset>0x00000063</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>SIZE</name>
              <description>Max Packet Size</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_8</name>
                  <description>8</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_16</name>
                  <description>16</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_32</name>
                  <description>32</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_64</name>
                  <description>64</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_128</name>
                  <description>128</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_256</name>
                  <description>256</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_512</name>
                  <description>512</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_1024</name>
                  <description>1024</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_2048</name>
                  <description>2048</description>
                  <value>0x8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DPB</name>
              <description>Double Packet Buffer Support</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TXFIFOADD</name>
          <displayName>USB_TXFIFOADD</displayName>
          <description>USB Transmit FIFO Start Address</description>
          <addressOffset>0x00000064</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Transmit/Receive Start Address</description>
              <lsb>0</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RXFIFOADD</name>
          <displayName>USB_RXFIFOADD</displayName>
          <description>USB Receive FIFO Start Address</description>
          <addressOffset>0x00000066</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Transmit/Receive Start Address</description>
              <lsb>0</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONTIM</name>
          <displayName>USB_CONTIM</displayName>
          <description>USB Connect Timing</description>
          <addressOffset>0x0000007A</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>WTID</name>
              <description>Wait ID</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>WTCON</name>
              <description>Connect Wait</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VPLEN</name>
          <displayName>USB_VPLEN</displayName>
          <description>USB OTG VBUS Pulse Timing</description>
          <addressOffset>0x0000007B</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>VPLEN</name>
              <description>VBUS Pulse Length</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FSEOF</name>
          <displayName>USB_FSEOF</displayName>
          <description>USB Full-Speed Last Transaction to End of Frame Timing</description>
          <addressOffset>0x0000007D</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FSEOFG</name>
              <description>Full-Speed End-of-Frame Gap</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LSEOF</name>
          <displayName>USB_LSEOF</displayName>
          <description>USB Low-Speed Last Transaction to End of Frame Timing</description>
          <addressOffset>0x0000007E</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>LSEOFG</name>
              <description>Low-Speed End-of-Frame Gap</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TXFUNCADDR0</name>
          <displayName>USB_TXFUNCADDR0</displayName>
          <description>USB Transmit Functional Address Endpoint 0</description>
          <addressOffset>0x00000080</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Device Address</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TXHUBADDR0</name>
          <displayName>USB_TXHUBADDR0</displayName>
          <description>USB Transmit Hub Address Endpoint 0</description>
          <addressOffset>0x00000082</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Hub Address</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TXHUBPORT0</name>
          <displayName>USB_TXHUBPORT0</displayName>
          <description>USB Transmit Hub Port Endpoint 0</description>
          <addressOffset>0x00000083</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>PORT</name>
              <description>Hub Port</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TXFUNCADDR1</name>
          <displayName>USB_TXFUNCADDR1</displayName>
          <description>USB Transmit Functional Address Endpoint 1</description>
          <addressOffset>0x00000088</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Device Address</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TXHUBADDR1</name>
          <displayName>USB_TXHUBADDR1</displayName>
          <description>USB Transmit Hub Address Endpoint 1</description>
          <addressOffset>0x0000008A</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Hub Address</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TXHUBPORT1</name>
          <displayName>USB_TXHUBPORT1</displayName>
          <description>USB Transmit Hub Port Endpoint 1</description>
          <addressOffset>0x0000008B</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>PORT</name>
              <description>Hub Port</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RXFUNCADDR1</name>
          <displayName>USB_RXFUNCADDR1</displayName>
          <description>USB Receive Functional Address Endpoint 1</description>
          <addressOffset>0x0000008C</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Device Address</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RXHUBADDR1</name>
          <displayName>USB_RXHUBADDR1</displayName>
          <description>USB Receive Hub Address Endpoint 1</description>
          <addressOffset>0x0000008E</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Hub Address</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RXHUBPORT1</name>
          <displayName>USB_RXHUBPORT1</displayName>
          <description>USB Receive Hub Port Endpoint 1</description>
          <addressOffset>0x0000008F</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>PORT</name>
              <description>Hub Port</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TXFUNCADDR2</name>
          <displayName>USB_TXFUNCADDR2</displayName>
          <description>USB Transmit Functional Address Endpoint 2</description>
          <addressOffset>0x00000090</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Device Address</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TXHUBADDR2</name>
          <displayName>USB_TXHUBADDR2</displayName>
          <description>USB Transmit Hub Address Endpoint 2</description>
          <addressOffset>0x00000092</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Hub Address</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TXHUBPORT2</name>
          <displayName>USB_TXHUBPORT2</displayName>
          <description>USB Transmit Hub Port Endpoint 2</description>
          <addressOffset>0x00000093</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>PORT</name>
              <description>Hub Port</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RXFUNCADDR2</name>
          <displayName>USB_RXFUNCADDR2</displayName>
          <description>USB Receive Functional Address Endpoint 2</description>
          <addressOffset>0x00000094</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Device Address</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RXHUBADDR2</name>
          <displayName>USB_RXHUBADDR2</displayName>
          <description>USB Receive Hub Address Endpoint 2</description>
          <addressOffset>0x00000096</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Hub Address</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RXHUBPORT2</name>
          <displayName>USB_RXHUBPORT2</displayName>
          <description>USB Receive Hub Port Endpoint 2</description>
          <addressOffset>0x00000097</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>PORT</name>
              <description>Hub Port</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TXFUNCADDR3</name>
          <displayName>USB_TXFUNCADDR3</displayName>
          <description>USB Transmit Functional Address Endpoint 3</description>
          <addressOffset>0x00000098</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Device Address</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TXHUBADDR3</name>
          <displayName>USB_TXHUBADDR3</displayName>
          <description>USB Transmit Hub Address Endpoint 3</description>
          <addressOffset>0x0000009A</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Hub Address</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TXHUBPORT3</name>
          <displayName>USB_TXHUBPORT3</displayName>
          <description>USB Transmit Hub Port Endpoint 3</description>
          <addressOffset>0x0000009B</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>PORT</name>
              <description>Hub Port</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RXFUNCADDR3</name>
          <displayName>USB_RXFUNCADDR3</displayName>
          <description>USB Receive Functional Address Endpoint 3</description>
          <addressOffset>0x0000009C</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Device Address</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RXHUBADDR3</name>
          <displayName>USB_RXHUBADDR3</displayName>
          <description>USB Receive Hub Address Endpoint 3</description>
          <addressOffset>0x0000009E</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Hub Address</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RXHUBPORT3</name>
          <displayName>USB_RXHUBPORT3</displayName>
          <description>USB Receive Hub Port Endpoint 3</description>
          <addressOffset>0x0000009F</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>PORT</name>
              <description>Hub Port</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TXFUNCADDR4</name>
          <displayName>USB_TXFUNCADDR4</displayName>
          <description>USB Transmit Functional Address Endpoint 4</description>
          <addressOffset>0x000000A0</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Device Address</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TXHUBADDR4</name>
          <displayName>USB_TXHUBADDR4</displayName>
          <description>USB Transmit Hub Address Endpoint 4</description>
          <addressOffset>0x000000A2</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Hub Address</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TXHUBPORT4</name>
          <displayName>USB_TXHUBPORT4</displayName>
          <description>USB Transmit Hub Port Endpoint 4</description>
          <addressOffset>0x000000A3</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>PORT</name>
              <description>Hub Port</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RXFUNCADDR4</name>
          <displayName>USB_RXFUNCADDR4</displayName>
          <description>USB Receive Functional Address Endpoint 4</description>
          <addressOffset>0x000000A4</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Device Address</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RXHUBADDR4</name>
          <displayName>USB_RXHUBADDR4</displayName>
          <description>USB Receive Hub Address Endpoint 4</description>
          <addressOffset>0x000000A6</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Hub Address</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RXHUBPORT4</name>
          <displayName>USB_RXHUBPORT4</displayName>
          <description>USB Receive Hub Port Endpoint 4</description>
          <addressOffset>0x000000A7</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>PORT</name>
              <description>Hub Port</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TXFUNCADDR5</name>
          <displayName>USB_TXFUNCADDR5</displayName>
          <description>USB Transmit Functional Address Endpoint 5</description>
          <addressOffset>0x000000A8</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Device Address</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TXHUBADDR5</name>
          <displayName>USB_TXHUBADDR5</displayName>
          <description>USB Transmit Hub Address Endpoint 5</description>
          <addressOffset>0x000000AA</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Hub Address</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TXHUBPORT5</name>
          <displayName>USB_TXHUBPORT5</displayName>
          <description>USB Transmit Hub Port Endpoint 5</description>
          <addressOffset>0x000000AB</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>PORT</name>
              <description>Hub Port</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RXFUNCADDR5</name>
          <displayName>USB_RXFUNCADDR5</displayName>
          <description>USB Receive Functional Address Endpoint 5</description>
          <addressOffset>0x000000AC</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Device Address</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RXHUBADDR5</name>
          <displayName>USB_RXHUBADDR5</displayName>
          <description>USB Receive Hub Address Endpoint 5</description>
          <addressOffset>0x000000AE</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Hub Address</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
