m-labs/dslite2svd/svd/tm4c123x-vendor.xml
        <register>
          <name>RXHUBPORT5</name>
          <displayName>USB_RXHUBPORT5</displayName>
          <description>USB Receive Hub Port Endpoint 5</description>
          <addressOffset>0x000000AF</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>PORT</name>
              <description>Hub Port</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TXFUNCADDR6</name>
          <displayName>USB_TXFUNCADDR6</displayName>
          <description>USB Transmit Functional Address Endpoint 6</description>
          <addressOffset>0x000000B0</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Device Address</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TXHUBADDR6</name>
          <displayName>USB_TXHUBADDR6</displayName>
          <description>USB Transmit Hub Address Endpoint 6</description>
          <addressOffset>0x000000B2</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Hub Address</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TXHUBPORT6</name>
          <displayName>USB_TXHUBPORT6</displayName>
          <description>USB Transmit Hub Port Endpoint 6</description>
          <addressOffset>0x000000B3</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>PORT</name>
              <description>Hub Port</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RXFUNCADDR6</name>
          <displayName>USB_RXFUNCADDR6</displayName>
          <description>USB Receive Functional Address Endpoint 6</description>
          <addressOffset>0x000000B4</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Device Address</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RXHUBADDR6</name>
          <displayName>USB_RXHUBADDR6</displayName>
          <description>USB Receive Hub Address Endpoint 6</description>
          <addressOffset>0x000000B6</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Hub Address</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RXHUBPORT6</name>
          <displayName>USB_RXHUBPORT6</displayName>
          <description>USB Receive Hub Port Endpoint 6</description>
          <addressOffset>0x000000B7</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>PORT</name>
              <description>Hub Port</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TXFUNCADDR7</name>
          <displayName>USB_TXFUNCADDR7</displayName>
          <description>USB Transmit Functional Address Endpoint 7</description>
          <addressOffset>0x000000B8</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Device Address</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TXHUBADDR7</name>
          <displayName>USB_TXHUBADDR7</displayName>
          <description>USB Transmit Hub Address Endpoint 7</description>
          <addressOffset>0x000000BA</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Hub Address</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TXHUBPORT7</name>
          <displayName>USB_TXHUBPORT7</displayName>
          <description>USB Transmit Hub Port Endpoint 7</description>
          <addressOffset>0x000000BB</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>PORT</name>
              <description>Hub Port</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RXFUNCADDR7</name>
          <displayName>USB_RXFUNCADDR7</displayName>
          <description>USB Receive Functional Address Endpoint 7</description>
          <addressOffset>0x000000BC</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Device Address</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RXHUBADDR7</name>
          <displayName>USB_RXHUBADDR7</displayName>
          <description>USB Receive Hub Address Endpoint 7</description>
          <addressOffset>0x000000BE</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Hub Address</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RXHUBPORT7</name>
          <displayName>USB_RXHUBPORT7</displayName>
          <description>USB Receive Hub Port Endpoint 7</description>
          <addressOffset>0x000000BF</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>PORT</name>
              <description>Hub Port</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CSRL0</name>
          <displayName>USB_CSRL0</displayName>
          <description>USB Control and Status Endpoint 0 Low</description>
          <addressOffset>0x00000102</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>RXRDY</name>
              <description>Receive Packet Ready</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>write-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TXRDY</name>
              <description>Transmit Packet Ready</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>write-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>STALLED</name>
              <description>Endpoint Stalled</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>write-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DATAEND</name>
              <description>Data End</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>write-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>SETUP</name>
              <description>Setup Packet</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>write-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>SETEND</name>
              <description>Setup End</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>write-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ERROR</name>
              <description>Error</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>write-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>REQPKT</name>
              <description>Request Packet</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>write-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>STALL</name>
              <description>Send Stall</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>write-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>STATUS</name>
              <description>STATUS Packet</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>write-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RXRDYC</name>
              <description>RXRDY Clear</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>write-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>NAKTO</name>
              <description>NAK Timeout</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>write-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>SETENDC</name>
              <description>Setup End Clear</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>write-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>CSRH0</name>
          <displayName>USB_CSRH0</displayName>
          <description>USB Control and Status Endpoint 0 High</description>
          <addressOffset>0x00000103</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLUSH</name>
              <description>Flush FIFO</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>write-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DT</name>
              <description>Data Toggle</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>write-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DTWE</name>
              <description>Data Toggle Write Enable</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>write-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>COUNT0</name>
          <displayName>USB_COUNT0</displayName>
          <description>USB Receive Byte Count Endpoint 0</description>
          <addressOffset>0x00000108</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>COUNT</name>
              <description>FIFO Count</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TYPE0</name>
          <displayName>USB_TYPE0</displayName>
          <description>USB Type Endpoint 0</description>
          <addressOffset>0x0000010A</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>SPEED</name>
              <description>Operating Speed</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FULL</name>
                  <description>Full</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>NAKLMT</name>
          <displayName>USB_NAKLMT</displayName>
          <description>USB NAK Limit</description>
          <addressOffset>0x0000010B</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>NAKLMT</name>
              <description>EP0 NAK Limit</description>
              <lsb>0</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TXMAXP1</name>
          <displayName>USB_TXMAXP1</displayName>
          <description>USB Maximum Transmit Data Endpoint 1</description>
          <addressOffset>0x00000110</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>MAXLOAD</name>
              <description>Maximum Payload</description>
              <lsb>0</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TXCSRL1</name>
          <displayName>USB_TXCSRL1</displayName>
          <description>USB Transmit Control and Status Endpoint 1 Low</description>
          <addressOffset>0x00000112</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>TXRDY</name>
              <description>Transmit Packet Ready</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>FIFONE</name>
              <description>FIFO Not Empty</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ERROR</name>
              <description>Error</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>UNDRN</name>
              <description>Underrun</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>FLUSH</name>
              <description>Flush FIFO</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>STALL</name>
              <description>Send STALL</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>SETUP</name>
              <description>Setup Packet</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>STALLED</name>
              <description>Endpoint Stalled</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CLRDT</name>
              <description>Clear Data Toggle</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>NAKTO</name>
              <description>NAK Timeout</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
