m-labs/dslite2svd/svd/tm4c123x-vendor.xml
        <register>
          <name>TXTYPE3</name>
          <displayName>USB_TXTYPE3</displayName>
          <description>USB Host Transmit Configure Type Endpoint 3</description>
          <addressOffset>0x0000013A</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>TEP</name>
              <description>Target Endpoint Number</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PROTO</name>
              <description>Protocol</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CTRL</name>
                  <description>Control</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ISOC</name>
                  <description>Isochronous</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BULK</name>
                  <description>Bulk</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INT</name>
                  <description>Interrupt</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPEED</name>
              <description>Operating Speed</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DFLT</name>
                  <description>Default</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FULL</name>
                  <description>Full</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TXINTERVAL3</name>
          <displayName>USB_TXINTERVAL3</displayName>
          <description>USB Host Transmit Interval Endpoint 3</description>
          <addressOffset>0x0000013B</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>TXPOLL</name>
              <description>TX Polling</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RXTYPE3</name>
          <displayName>USB_RXTYPE3</displayName>
          <description>USB Host Configure Receive Type Endpoint 3</description>
          <addressOffset>0x0000013C</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>TEP</name>
              <description>Target Endpoint Number</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PROTO</name>
              <description>Protocol</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CTRL</name>
                  <description>Control</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ISOC</name>
                  <description>Isochronous</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BULK</name>
                  <description>Bulk</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INT</name>
                  <description>Interrupt</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPEED</name>
              <description>Operating Speed</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DFLT</name>
                  <description>Default</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FULL</name>
                  <description>Full</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RXINTERVAL3</name>
          <displayName>USB_RXINTERVAL3</displayName>
          <description>USB Host Receive Polling Interval Endpoint 3</description>
          <addressOffset>0x0000013D</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>TXPOLL</name>
              <description>RX Polling</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TXMAXP4</name>
          <displayName>USB_TXMAXP4</displayName>
          <description>USB Maximum Transmit Data Endpoint 4</description>
          <addressOffset>0x00000140</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>MAXLOAD</name>
              <description>Maximum Payload</description>
              <lsb>0</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TXCSRL4</name>
          <displayName>USB_TXCSRL4</displayName>
          <description>USB Transmit Control and Status Endpoint 4 Low</description>
          <addressOffset>0x00000142</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>TXRDY</name>
              <description>Transmit Packet Ready</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>FIFONE</name>
              <description>FIFO Not Empty</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ERROR</name>
              <description>Error</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>UNDRN</name>
              <description>Underrun</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>FLUSH</name>
              <description>Flush FIFO</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>SETUP</name>
              <description>Setup Packet</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>STALL</name>
              <description>Send STALL</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>STALLED</name>
              <description>Endpoint Stalled</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CLRDT</name>
              <description>Clear Data Toggle</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>NAKTO</name>
              <description>NAK Timeout</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TXCSRH4</name>
          <displayName>USB_TXCSRH4</displayName>
          <description>USB Transmit Control and Status Endpoint 4 High</description>
          <addressOffset>0x00000143</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>DT</name>
              <description>Data Toggle</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DTWE</name>
              <description>Data Toggle Write Enable</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DMAMOD</name>
              <description>DMA Request Mode</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>FDT</name>
              <description>Force Data Toggle</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DMAEN</name>
              <description>DMA Request Enable</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MODE</name>
              <description>Mode</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ISO</name>
              <description>Isochronous Transfers</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>AUTOSET</name>
              <description>Auto Set</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>RXMAXP4</name>
          <displayName>USB_RXMAXP4</displayName>
          <description>USB Maximum Receive Data Endpoint 4</description>
          <addressOffset>0x00000144</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>MAXLOAD</name>
              <description>Maximum Payload</description>
              <lsb>0</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RXCSRL4</name>
          <displayName>USB_RXCSRL4</displayName>
          <description>USB Receive Control and Status Endpoint 4 Low</description>
          <addressOffset>0x00000146</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>RXRDY</name>
              <description>Receive Packet Ready</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>FULL</name>
              <description>FIFO Full</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>OVER</name>
              <description>Overrun</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ERROR</name>
              <description>Error</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>NAKTO</name>
              <description>NAK Timeout</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DATAERR</name>
              <description>Data Error</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>FLUSH</name>
              <description>Flush FIFO</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>STALL</name>
              <description>Send STALL</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>REQPKT</name>
              <description>Request Packet</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>STALLED</name>
              <description>Endpoint Stalled</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CLRDT</name>
              <description>Clear Data Toggle</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
