m-labs/dslite2svd/svd/tm4c123x-vendor.xml
        <register>
          <name>RXCSRL5</name>
          <displayName>USB_RXCSRL5</displayName>
          <description>USB Receive Control and Status Endpoint 5 Low</description>
          <addressOffset>0x00000156</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>RXRDY</name>
              <description>Receive Packet Ready</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>FULL</name>
              <description>FIFO Full</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ERROR</name>
              <description>Error</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>OVER</name>
              <description>Overrun</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>NAKTO</name>
              <description>NAK Timeout</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DATAERR</name>
              <description>Data Error</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>FLUSH</name>
              <description>Flush FIFO</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>STALL</name>
              <description>Send STALL</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>REQPKT</name>
              <description>Request Packet</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>STALLED</name>
              <description>Endpoint Stalled</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CLRDT</name>
              <description>Clear Data Toggle</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>RXCSRH5</name>
          <displayName>USB_RXCSRH5</displayName>
          <description>USB Receive Control and Status Endpoint 5 High</description>
          <addressOffset>0x00000157</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>DT</name>
              <description>Data Toggle</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DTWE</name>
              <description>Data Toggle Write Enable</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DMAMOD</name>
              <description>DMA Request Mode</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DISNYET</name>
              <description>Disable NYET</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PIDERR</name>
              <description>PID Error</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DMAEN</name>
              <description>DMA Request Enable</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>AUTORQ</name>
              <description>Auto Request</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ISO</name>
              <description>Isochronous Transfers</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>AUTOCL</name>
              <description>Auto Clear</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>RXCOUNT5</name>
          <displayName>USB_RXCOUNT5</displayName>
          <description>USB Receive Byte Count Endpoint 5</description>
          <addressOffset>0x00000158</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>COUNT</name>
              <description>Receive Packet Count</description>
              <lsb>0</lsb>
              <msb>12</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TXTYPE5</name>
          <displayName>USB_TXTYPE5</displayName>
          <description>USB Host Transmit Configure Type Endpoint 5</description>
          <addressOffset>0x0000015A</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>TEP</name>
              <description>Target Endpoint Number</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PROTO</name>
              <description>Protocol</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CTRL</name>
                  <description>Control</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ISOC</name>
                  <description>Isochronous</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BULK</name>
                  <description>Bulk</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INT</name>
                  <description>Interrupt</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPEED</name>
              <description>Operating Speed</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DFLT</name>
                  <description>Default</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FULL</name>
                  <description>Full</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TXINTERVAL5</name>
          <displayName>USB_TXINTERVAL5</displayName>
          <description>USB Host Transmit Interval Endpoint 5</description>
          <addressOffset>0x0000015B</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>TXPOLL</name>
              <description>TX Polling</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RXTYPE5</name>
          <displayName>USB_RXTYPE5</displayName>
          <description>USB Host Configure Receive Type Endpoint 5</description>
          <addressOffset>0x0000015C</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>TEP</name>
              <description>Target Endpoint Number</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PROTO</name>
              <description>Protocol</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CTRL</name>
                  <description>Control</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ISOC</name>
                  <description>Isochronous</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BULK</name>
                  <description>Bulk</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INT</name>
                  <description>Interrupt</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPEED</name>
              <description>Operating Speed</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DFLT</name>
                  <description>Default</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FULL</name>
                  <description>Full</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RXINTERVAL5</name>
          <displayName>USB_RXINTERVAL5</displayName>
          <description>USB Host Receive Polling Interval Endpoint 5</description>
          <addressOffset>0x0000015D</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>TXPOLL</name>
              <description>RX Polling</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TXMAXP6</name>
          <displayName>USB_TXMAXP6</displayName>
          <description>USB Maximum Transmit Data Endpoint 6</description>
          <addressOffset>0x00000160</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>MAXLOAD</name>
              <description>Maximum Payload</description>
              <lsb>0</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TXCSRL6</name>
          <displayName>USB_TXCSRL6</displayName>
          <description>USB Transmit Control and Status Endpoint 6 Low</description>
          <addressOffset>0x00000162</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>TXRDY</name>
              <description>Transmit Packet Ready</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>FIFONE</name>
              <description>FIFO Not Empty</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ERROR</name>
              <description>Error</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>UNDRN</name>
              <description>Underrun</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>FLUSH</name>
              <description>Flush FIFO</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>STALL</name>
              <description>Send STALL</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>SETUP</name>
              <description>Setup Packet</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>STALLED</name>
              <description>Endpoint Stalled</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CLRDT</name>
              <description>Clear Data Toggle</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>NAKTO</name>
              <description>NAK Timeout</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
