m-labs/dslite2svd/svd/tm4c123x-vendor.xml
        <register>
          <name>GPCS</name>
          <displayName>USB_GPCS</displayName>
          <description>USB General-Purpose Control and Status</description>
          <addressOffset>0x0000041C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DEVMOD</name>
              <description>Device Mode</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DEVMODOTG</name>
              <description>Enable Device Mode</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>VDC</name>
          <displayName>USB_VDC</displayName>
          <description>USB VBUS Droop Control</description>
          <addressOffset>0x00000430</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>VBDEN</name>
              <description>VBUS Droop Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>VDCRIS</name>
          <displayName>USB_VDCRIS</displayName>
          <description>USB VBUS Droop Control Raw Interrupt Status</description>
          <addressOffset>0x00000434</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>VD</name>
              <description>VBUS Droop Raw Interrupt Status</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>VDCIM</name>
          <displayName>USB_VDCIM</displayName>
          <description>USB VBUS Droop Control Interrupt Mask</description>
          <addressOffset>0x00000438</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>VD</name>
              <description>VBUS Droop Interrupt Mask</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>VDCISC</name>
          <displayName>USB_VDCISC</displayName>
          <description>USB VBUS Droop Control Interrupt Status and Clear</description>
          <addressOffset>0x0000043C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>VD</name>
              <description>VBUS Droop Interrupt Status and Clear</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>IDVRIS</name>
          <displayName>USB_IDVRIS</displayName>
          <description>USB ID Valid Detect Raw Interrupt Status</description>
          <addressOffset>0x00000444</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ID</name>
              <description>ID Valid Detect Raw Interrupt Status</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>IDVIM</name>
          <displayName>USB_IDVIM</displayName>
          <description>USB ID Valid Detect Interrupt Mask</description>
          <addressOffset>0x00000448</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ID</name>
              <description>ID Valid Detect Interrupt Mask</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>IDVISC</name>
          <displayName>USB_IDVISC</displayName>
          <description>USB ID Valid Detect Interrupt Status and Clear</description>
          <addressOffset>0x0000044C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ID</name>
              <description>ID Valid Detect Interrupt Status and Clear</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DMASEL</name>
          <displayName>USB_DMASEL</displayName>
          <description>USB DMA Select</description>
          <addressOffset>0x00000450</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DMAARX</name>
              <description>DMA A RX Select</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DMAATX</name>
              <description>DMA A TX Select</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DMABRX</name>
              <description>DMA B RX Select</description>
              <lsb>8</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DMABTX</name>
              <description>DMA B TX Select</description>
              <lsb>12</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DMACRX</name>
              <description>DMA C RX Select</description>
              <lsb>16</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DMACTX</name>
              <description>DMA C TX Select</description>
              <lsb>20</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PP</name>
          <displayName>USB_PP</displayName>
          <description>USB Peripheral Properties</description>
          <addressOffset>0x00000FC0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TYPE</name>
              <description>Controller Type</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_0</name>
                  <description>The first-generation USB controller</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PHY</name>
              <description>PHY Present</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>USB</name>
              <description>USB Capability</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEVICE</name>
                  <description>DEVICE</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HOSTDEVICE</name>
                  <description>HOST</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OTG</name>
                  <description>OTG</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ECNT</name>
              <description>Endpoint Count</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
