m-labs/dslite2svd/svd/tm4c123x-vendor.xml
      </registers>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4cc231e6pm/gpio.xml -->
    <peripheral derivedFrom="GPIO_PORTA">
      <name>GPIO_PORTA_AHB</name>
      <baseAddress>0x40058000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4cc231e6pm/gpio.xml -->
    <peripheral derivedFrom="GPIO_PORTA">
      <name>GPIO_PORTB_AHB</name>
      <baseAddress>0x40059000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4cc231e6pm/gpio.xml -->
    <peripheral derivedFrom="GPIO_PORTA">
      <name>GPIO_PORTC_AHB</name>
      <baseAddress>0x4005A000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4cc231e6pm/gpio.xml -->
    <peripheral derivedFrom="GPIO_PORTA">
      <name>GPIO_PORTD_AHB</name>
      <baseAddress>0x4005B000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4cc231e6pm/gpio.xml -->
    <peripheral derivedFrom="GPIO_PORTA">
      <name>GPIO_PORTE_AHB</name>
      <baseAddress>0x4005C000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4cc231e6pm/gpio.xml -->
    <peripheral derivedFrom="GPIO_PORTA">
      <name>GPIO_PORTF_AHB</name>
      <baseAddress>0x4005D000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4cc231e6pm/eeprom.xml -->
    <peripheral>
      <name>EEPROM</name>
      <description>EEPROM register offsets</description>
      <baseAddress>0x400AF000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
      <registers>
        <register>
          <name>EESIZE</name>
          <displayName>EEPROM_EESIZE</displayName>
          <description>EEPROM Size Information</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>WORDCNT</name>
              <description>Number of 32-Bit Words</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>BLKCNT</name>
              <description>Number of 16-Word Blocks</description>
              <lsb>16</lsb>
              <msb>26</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EEBLOCK</name>
          <displayName>EEPROM_EEBLOCK</displayName>
          <description>EEPROM Current Block</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>BLOCK</name>
              <description>Current Block</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EEOFFSET</name>
          <displayName>EEPROM_EEOFFSET</displayName>
          <description>EEPROM Current Offset</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OFFSET</name>
              <description>Current Address Offset</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EERDWR</name>
          <displayName>EEPROM_EERDWR</displayName>
          <description>EEPROM Read-Write</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>VALUE</name>
              <description>EEPROM Read or Write Data</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EERDWRINC</name>
          <displayName>EEPROM_EERDWRINC</displayName>
          <description>EEPROM Read-Write with Increment</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>VALUE</name>
              <description>EEPROM Read or Write Data with Increment</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EEDONE</name>
          <displayName>EEPROM_EEDONE</displayName>
          <description>EEPROM Done Status</description>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>WORKING</name>
              <description>EEPROM Working</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>WKERASE</name>
              <description>Working on an Erase</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>WKCOPY</name>
              <description>Working on a Copy</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>NOPERM</name>
              <description>Write Without Permission</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>WRBUSY</name>
              <description>Write Busy</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>EESUPP</name>
          <displayName>EEPROM_EESUPP</displayName>
          <description>EEPROM Support Control and Status</description>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ERETRY</name>
              <description>Erase Must Be Retried</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PRETRY</name>
              <description>Programming Must Be Retried</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>EEUNLOCK</name>
          <displayName>EEPROM_EEUNLOCK</displayName>
          <description>EEPROM Unlock</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>UNLOCK</name>
              <description>EEPROM Unlock</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EEPROT</name>
          <displayName>EEPROM_EEPROT</displayName>
          <description>EEPROM Protection</description>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PROT</name>
              <description>Protection Control</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RWNPW</name>
                  <description>This setting is the default. If there is no password, the block is not protected and is readable and writable</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RWPW</name>
                  <description>If there is a password, the block is readable or writable only when unlocked</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RONPW</name>
                  <description>If there is no password, the block is readable, not writable</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACC</name>
              <description>Access Control</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>EEPASS0</name>
          <displayName>EEPROM_EEPASS0</displayName>
          <description>EEPROM Password</description>
          <addressOffset>0x00000034</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PASS</name>
              <description>Password</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EEPASS1</name>
          <displayName>EEPROM_EEPASS1</displayName>
          <description>EEPROM Password</description>
          <addressOffset>0x00000038</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PASS</name>
              <description>Password</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EEPASS2</name>
          <displayName>EEPROM_EEPASS2</displayName>
          <description>EEPROM Password</description>
          <addressOffset>0x0000003C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PASS</name>
              <description>Password</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EEINT</name>
          <displayName>EEPROM_EEINT</displayName>
          <description>EEPROM Interrupt</description>
          <addressOffset>0x00000040</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INT</name>
              <description>Interrupt Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>EEHIDE</name>
          <displayName>EEPROM_EEHIDE</displayName>
          <description>EEPROM Block Hide</description>
          <addressOffset>0x00000050</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HN</name>
              <description>Hide Block</description>
              <lsb>1</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EEDBGME</name>
          <displayName>EEPROM_EEDBGME</displayName>
          <description>EEPROM Debug Mass Erase</description>
          <addressOffset>0x00000080</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ME</name>
              <description>Mass Erase</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>KEY</name>
              <description>Erase Key</description>
              <lsb>16</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PP</name>
          <displayName>EEPROM_PP</displayName>
          <description>EEPROM Peripheral Properties</description>
          <addressOffset>0x00000FC0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SIZE</name>
              <description>EEPROM Size</description>
              <lsb>0</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
