m-labs/dslite2svd/svd/tm4c123x-vendor.xml
      </registers>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4ce93xh6pm/flash.xml -->
    <peripheral>
      <name>FLASH_CTRL</name>
      <description>FLASH register offsets</description>
      <baseAddress>0x400FD000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00002000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
      <registers>
        <register>
          <name>FMA</name>
          <displayName>FLASH_FMA</displayName>
          <description>Flash Memory Address</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OFFSET</name>
              <description>Address Offset</description>
              <lsb>0</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FMD</name>
          <displayName>FLASH_FMD</displayName>
          <description>Flash Memory Data</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DATA</name>
              <description>Data Value</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FMC</name>
          <displayName>FLASH_FMC</displayName>
          <description>Flash Memory Control</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>WRITE</name>
              <description>Write a Word into Flash Memory</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ERASE</name>
              <description>Erase a Page of Flash Memory</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MERASE</name>
              <description>Mass Erase Flash Memory</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>COMT</name>
              <description>Commit Register Value</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>WRKEY</name>
              <description>FLASH write key</description>
              <lsb>17</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FCRIS</name>
          <displayName>FLASH_FCRIS</displayName>
          <description>Flash Controller Raw Interrupt Status</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ARIS</name>
              <description>Access Raw Interrupt Status</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PRIS</name>
              <description>Programming Raw Interrupt Status</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ERIS</name>
              <description>EEPROM Raw Interrupt Status</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>VOLTRIS</name>
              <description>Pump Voltage Raw Interrupt Status</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INVDRIS</name>
              <description>Invalid Data Raw Interrupt Status</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ERRIS</name>
              <description>Erase Verify Error Raw Interrupt Status</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PROGRIS</name>
              <description>Program Verify Error Raw Interrupt Status</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>FCIM</name>
          <displayName>FLASH_FCIM</displayName>
          <description>Flash Controller Interrupt Mask</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>AMASK</name>
              <description>Access Interrupt Mask</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PMASK</name>
              <description>Programming Interrupt Mask</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>EMASK</name>
              <description>EEPROM Interrupt Mask</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>VOLTMASK</name>
              <description>VOLT Interrupt Mask</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INVDMASK</name>
              <description>Invalid Data Interrupt Mask</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ERMASK</name>
              <description>ERVER Interrupt Mask</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PROGMASK</name>
              <description>PROGVER Interrupt Mask</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>FCMISC</name>
          <displayName>FLASH_FCMISC</displayName>
          <description>Flash Controller Masked Interrupt Status and Clear</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>AMISC</name>
              <description>Access Masked Interrupt Status and Clear</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PMISC</name>
              <description>Programming Masked Interrupt Status and Clear</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>EMISC</name>
              <description>EEPROM Masked Interrupt Status and Clear</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>VOLTMISC</name>
              <description>VOLT Masked Interrupt Status and Clear</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INVDMISC</name>
              <description>Invalid Data Masked Interrupt Status and Clear</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ERMISC</name>
              <description>ERVER Masked Interrupt Status and Clear</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PROGMISC</name>
              <description>PROGVER Masked Interrupt Status and Clear</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>FMC2</name>
          <displayName>FLASH_FMC2</displayName>
          <description>Flash Memory Control 2</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>WRBUF</name>
              <description>Buffered Flash Memory Write</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>FWBVAL</name>
          <displayName>FLASH_FWBVAL</displayName>
          <description>Flash Write Buffer Valid</description>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FWB</name>
              <description>Flash Memory Write Buffer</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FWBN</name>
          <displayName>FLASH_FWBN</displayName>
          <description>Flash Write Buffer n</description>
          <addressOffset>0x00000100</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DATA</name>
              <description>Data</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FSIZE</name>
          <displayName>FLASH_FSIZE</displayName>
          <description>Flash Size</description>
          <addressOffset>0x00000FC0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SIZE</name>
              <description>Flash Size</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_256KB</name>
                  <description>256 KB of Flash</description>
                  <value>0x7f</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SSIZE</name>
          <displayName>FLASH_SSIZE</displayName>
          <description>SRAM Size</description>
          <addressOffset>0x00000FC4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SIZE</name>
              <description>SRAM Size</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_32KB</name>
                  <description>32 KB of SRAM</description>
                  <value>0x7f</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ROMSWMAP</name>
          <displayName>FLASH_ROMSWMAP</displayName>
          <description>ROM Software Map</description>
          <addressOffset>0x00000FCC</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SAFERTOS</name>
              <description>SafeRTOS Present</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>RMCTL</name>
          <displayName>FLASH_RMCTL</displayName>
          <description>ROM Control</description>
          <addressOffset>0x000010F0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>BA</name>
              <description>Boot Alias</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
