m-labs/dslite2svd/svd/tm4c123x-vendor.xml
        <register>
          <name>BOOTCFG</name>
          <displayName>FLASH_BOOTCFG</displayName>
          <description>Boot Configuration</description>
          <addressOffset>0x000011D0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DBG0</name>
              <description>Debug Control 0</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DBG1</name>
              <description>Debug Control 1</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>KEY</name>
              <description>KEY Select</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>EN</name>
              <description>Boot GPIO Enable</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>POL</name>
              <description>Boot GPIO Polarity</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PIN</name>
              <description>Boot GPIO Pin</description>
              <lsb>10</lsb>
              <msb>12</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_0</name>
                  <description>Pin 0</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_1</name>
                  <description>Pin 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_2</name>
                  <description>Pin 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_3</name>
                  <description>Pin 3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_4</name>
                  <description>Pin 4</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_5</name>
                  <description>Pin 5</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_6</name>
                  <description>Pin 6</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_7</name>
                  <description>Pin 7</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PORT</name>
              <description>Boot GPIO Port</description>
              <lsb>13</lsb>
              <msb>15</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>A</name>
                  <description>Port A</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B</name>
                  <description>Port B</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>C</name>
                  <description>Port C</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D</name>
                  <description>Port D</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>E</name>
                  <description>Port E</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>F</name>
                  <description>Port F</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>G</name>
                  <description>Port G</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>H</name>
                  <description>Port H</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NW</name>
              <description>Not Written</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>USERREG0</name>
          <displayName>FLASH_USERREG0</displayName>
          <description>User Register 0</description>
          <addressOffset>0x000011E0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DATA</name>
              <description>User Data</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USERREG1</name>
          <displayName>FLASH_USERREG1</displayName>
          <description>User Register 1</description>
          <addressOffset>0x000011E4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DATA</name>
              <description>User Data</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USERREG2</name>
          <displayName>FLASH_USERREG2</displayName>
          <description>User Register 2</description>
          <addressOffset>0x000011E8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DATA</name>
              <description>User Data</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USERREG3</name>
          <displayName>FLASH_USERREG3</displayName>
          <description>User Register 3</description>
          <addressOffset>0x000011EC</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DATA</name>
              <description>User Data</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FMPRE0</name>
          <displayName>FLASH_FMPRE0</displayName>
          <description>Flash Memory Protection Read Enable 0</description>
          <addressOffset>0x00001200</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>FMPRE1</name>
          <displayName>FLASH_FMPRE1</displayName>
          <description>Flash Memory Protection Read Enable 1</description>
          <addressOffset>0x00001204</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>FMPRE2</name>
          <displayName>FLASH_FMPRE2</displayName>
          <description>Flash Memory Protection Read Enable 2</description>
          <addressOffset>0x00001208</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>FMPRE3</name>
          <displayName>FLASH_FMPRE3</displayName>
          <description>Flash Memory Protection Read Enable 3</description>
          <addressOffset>0x0000120C</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>FMPPE0</name>
          <displayName>FLASH_FMPPE0</displayName>
          <description>Flash Memory Protection Program Enable 0</description>
          <addressOffset>0x00001400</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>FMPPE1</name>
          <displayName>FLASH_FMPPE1</displayName>
          <description>Flash Memory Protection Program Enable 1</description>
          <addressOffset>0x00001404</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>FMPPE2</name>
          <displayName>FLASH_FMPPE2</displayName>
          <description>Flash Memory Protection Program Enable 2</description>
          <addressOffset>0x00001408</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>FMPPE3</name>
          <displayName>FLASH_FMPPE3</displayName>
          <description>Flash Memory Protection Program Enable 3</description>
          <addressOffset>0x0000140C</addressOffset>
          <size>32</size>
        </register>
