m-labs/dslite2svd/svd/tm4c123x-vendor.xml
      </registers>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4ce93xh6pm/sysctl.xml -->
    <peripheral>
      <name>SYSCTL</name>
      <description>System Control register addresses</description>
      <baseAddress>0x400FE000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
      <registers>
        <register>
          <name>DID0</name>
          <displayName>SYSCTL_DID0</displayName>
          <description>Device Identification 0</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MIN</name>
              <description>Minor Revision</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_0</name>
                  <description>Initial device, or a major revision update</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_1</name>
                  <description>First metal layer change</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_2</name>
                  <description>Second metal layer change</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MAJ</name>
              <description>Major Revision</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REVA</name>
                  <description>Revision A (initial device)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REVB</name>
                  <description>Revision B (first base layer revision)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REVC</name>
                  <description>Revision C (second base layer revision)</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLASS</name>
              <description>Device Class</description>
              <lsb>16</lsb>
              <msb>23</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TM4C123</name>
                  <description>Tiva TM4C123x and TM4E123x microcontrollers</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VER</name>
              <description>DID0 Version</description>
              <lsb>28</lsb>
              <msb>30</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_1</name>
                  <description>Second version of the DID0 register format.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DID1</name>
          <displayName>SYSCTL_DID1</displayName>
          <description>Device Identification 1</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>QUAL</name>
              <description>Qualification Status</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ES</name>
                  <description>Engineering Sample (unqualified)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PP</name>
                  <description>Pilot Production (unqualified)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FQ</name>
                  <description>Fully Qualified</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ROHS</name>
              <description>RoHS-Compliance</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PKG</name>
              <description>Package Type</description>
              <lsb>3</lsb>
              <msb>4</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>QFP</name>
                  <description>QFP package</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BGA</name>
                  <description>BGA package</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TEMP</name>
              <description>Temperature Range</description>
              <lsb>5</lsb>
              <msb>7</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>I</name>
                  <description>Industrial temperature range</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>E</name>
                  <description>Extended temperature range</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IE</name>
                  <description>Available in both industrial temperature range (-40C to 85C) and extended temperature range (-40C to 105C) devices. See</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PINCNT</name>
              <description>Package Pin Count</description>
              <lsb>13</lsb>
              <msb>15</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_100</name>
                  <description>100-pin LQFP package</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_64</name>
                  <description>64-pin LQFP package</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_144</name>
                  <description>144-pin LQFP package</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_157</name>
                  <description>157-pin BGA package</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_128</name>
                  <description>128-pin TQFP package</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRTNO</name>
              <description>Part Number</description>
              <lsb>16</lsb>
              <msb>23</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>FAM</name>
              <description>Family</description>
              <lsb>24</lsb>
              <msb>27</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>VER</name>
              <description>DID1 Version</description>
              <lsb>28</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DC0</name>
          <displayName>SYSCTL_DC0</displayName>
          <description>Device Capabilities 0</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FLASHSZ</name>
              <description>Flash Size</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_8KB</name>
                  <description>8 KB of Flash</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_16KB</name>
                  <description>16 KB of Flash</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_32KB</name>
                  <description>32 KB of Flash</description>
                  <value>0xf</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_64KB</name>
                  <description>64 KB of Flash</description>
                  <value>0x1f</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_96KB</name>
                  <description>96 KB of Flash</description>
                  <value>0x2f</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_128K</name>
                  <description>128 KB of Flash</description>
                  <value>0x3f</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_192K</name>
                  <description>192 KB of Flash</description>
                  <value>0x5f</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_256K</name>
                  <description>256 KB of Flash</description>
                  <value>0x7f</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAMSZ</name>
              <description>SRAM Size</description>
              <lsb>16</lsb>
              <msb>31</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_2KB</name>
                  <description>2 KB of SRAM</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_4KB</name>
                  <description>4 KB of SRAM</description>
                  <value>0xf</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_6KB</name>
                  <description>6 KB of SRAM</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_8KB</name>
                  <description>8 KB of SRAM</description>
                  <value>0x1f</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_12KB</name>
                  <description>12 KB of SRAM</description>
                  <value>0x2f</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_16KB</name>
                  <description>16 KB of SRAM</description>
                  <value>0x3f</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_20KB</name>
                  <description>20 KB of SRAM</description>
                  <value>0x4f</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_24KB</name>
                  <description>24 KB of SRAM</description>
                  <value>0x5f</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_32KB</name>
                  <description>32 KB of SRAM</description>
                  <value>0x7f</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
