m-labs/dslite2svd/svd/tm4c123x-vendor.xml
        <register>
          <name>DC1</name>
          <displayName>SYSCTL_DC1</displayName>
          <description>Device Capabilities 1</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>JTAG</name>
              <description>JTAG Present</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>SWD</name>
              <description>SWD Present</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>SWO</name>
              <description>SWO Trace Port Present</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>WDT0</name>
              <description>Watchdog Timer 0 Present</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PLL</name>
              <description>PLL Present</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TEMP</name>
              <description>Temp Sensor Present</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>HIB</name>
              <description>Hibernation Module Present</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MPU</name>
              <description>MPU Present</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ADC0SPD</name>
              <description>Max ADC0 Speed</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_125K</name>
                  <description>125K samples/second</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_250K</name>
                  <description>250K samples/second</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_500K</name>
                  <description>500K samples/second</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_1M</name>
                  <description>1M samples/second</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC1SPD</name>
              <description>Max ADC1 Speed</description>
              <lsb>10</lsb>
              <msb>11</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_125K</name>
                  <description>125K samples/second</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_250K</name>
                  <description>250K samples/second</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_500K</name>
                  <description>500K samples/second</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_1M</name>
                  <description>1M samples/second</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MINSYSDIV</name>
              <description>System Clock Divider</description>
              <lsb>12</lsb>
              <msb>15</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_80</name>
                  <description>Specifies an 80-MHz CPU clock with a PLL divider of 2.5</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_50</name>
                  <description>Specifies a 50-MHz CPU clock with a PLL divider of 4</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_40</name>
                  <description>Specifies a 40-MHz CPU clock with a PLL divider of 5</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_25</name>
                  <description>Specifies a 25-MHz clock with a PLL divider of 8</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_20</name>
                  <description>Specifies a 20-MHz clock with a PLL divider of 10</description>
                  <value>0x9</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC0</name>
              <description>ADC Module 0 Present</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ADC1</name>
              <description>ADC Module 1 Present</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PWM0</name>
              <description>PWM Module 0 Present</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PWM1</name>
              <description>PWM Module 1 Present</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CAN0</name>
              <description>CAN Module 0 Present</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CAN1</name>
              <description>CAN Module 1 Present</description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>WDT1</name>
              <description>Watchdog Timer1 Present</description>
              <lsb>28</lsb>
              <msb>28</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DC2</name>
          <displayName>SYSCTL_DC2</displayName>
          <description>Device Capabilities 2</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>UART0</name>
              <description>UART Module 0 Present</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>UART1</name>
              <description>UART Module 1 Present</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>UART2</name>
              <description>UART Module 2 Present</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>SSI0</name>
              <description>SSI Module 0 Present</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>SSI1</name>
              <description>SSI Module 1 Present</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>QEI0</name>
              <description>QEI Module 0 Present</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>QEI1</name>
              <description>QEI Module 1 Present</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>I2C0</name>
              <description>I2C Module 0 Present</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>I2C0HS</name>
              <description>I2C Module 0 Speed</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>I2C1</name>
              <description>I2C Module 1 Present</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>I2C1HS</name>
              <description>I2C Module 1 Speed</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TIMER0</name>
              <description>Timer Module 0 Present</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TIMER1</name>
              <description>Timer Module 1 Present</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TIMER2</name>
              <description>Timer Module 2 Present</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TIMER3</name>
              <description>Timer Module 3 Present</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>COMP0</name>
              <description>Analog Comparator 0 Present</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>COMP1</name>
              <description>Analog Comparator 1 Present</description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>COMP2</name>
              <description>Analog Comparator 2 Present</description>
              <lsb>26</lsb>
              <msb>26</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>I2S0</name>
              <description>I2S Module 0 Present</description>
              <lsb>28</lsb>
              <msb>28</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>EPI0</name>
              <description>EPI Module 0 Present</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
