m-labs/dslite2svd/svd/tm4c123x-vendor.xml
        <register>
          <name>DC5</name>
          <displayName>SYSCTL_DC5</displayName>
          <description>Device Capabilities 5</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PWM0</name>
              <description>PWM0 Pin Present</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PWM1</name>
              <description>PWM1 Pin Present</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PWM2</name>
              <description>PWM2 Pin Present</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PWM3</name>
              <description>PWM3 Pin Present</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PWM4</name>
              <description>PWM4 Pin Present</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PWM5</name>
              <description>PWM5 Pin Present</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PWM6</name>
              <description>PWM6 Pin Present</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PWM7</name>
              <description>PWM7 Pin Present</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PWMESYNC</name>
              <description>PWM Extended SYNC Active</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PWMEFLT</name>
              <description>PWM Extended Fault Active</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PWMFAULT0</name>
              <description>PWM Fault 0 Pin Present</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PWMFAULT1</name>
              <description>PWM Fault 1 Pin Present</description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PWMFAULT2</name>
              <description>PWM Fault 2 Pin Present</description>
              <lsb>26</lsb>
              <msb>26</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PWMFAULT3</name>
              <description>PWM Fault 3 Pin Present</description>
              <lsb>27</lsb>
              <msb>27</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DC6</name>
          <displayName>SYSCTL_DC6</displayName>
          <description>Device Capabilities 6</description>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>USB0</name>
              <description>USB Module 0 Present</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEV</name>
                  <description>USB0 is Device Only</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HOSTDEV</name>
                  <description>USB is Device or Host</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OTG</name>
                  <description>USB0 is OTG</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USB0PHY</name>
              <description>USB Module 0 PHY Present</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DC7</name>
          <displayName>SYSCTL_DC7</displayName>
          <description>Device Capabilities 7</description>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DMACH0</name>
              <description>DMA Channel 0</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DMACH1</name>
              <description>DMA Channel 1</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DMACH2</name>
              <description>DMA Channel 2</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DMACH3</name>
              <description>DMA Channel 3</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DMACH4</name>
              <description>DMA Channel 4</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DMACH5</name>
              <description>DMA Channel 5</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DMACH6</name>
              <description>DMA Channel 6</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DMACH7</name>
              <description>DMA Channel 7</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DMACH8</name>
              <description>DMA Channel 8</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DMACH9</name>
              <description>DMA Channel 9</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DMACH10</name>
              <description>DMA Channel 10</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DMACH11</name>
              <description>DMA Channel 11</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DMACH12</name>
              <description>DMA Channel 12</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DMACH13</name>
              <description>DMA Channel 13</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DMACH14</name>
              <description>DMA Channel 14</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DMACH15</name>
              <description>DMA Channel 15</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DMACH16</name>
              <description>DMA Channel 16</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DMACH17</name>
              <description>DMA Channel 17</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DMACH18</name>
              <description>DMA Channel 18</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DMACH19</name>
              <description>DMA Channel 19</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DMACH20</name>
              <description>DMA Channel 20</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DMACH21</name>
              <description>DMA Channel 21</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DMACH22</name>
              <description>DMA Channel 22</description>
              <lsb>22</lsb>
              <msb>22</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DMACH23</name>
              <description>DMA Channel 23</description>
              <lsb>23</lsb>
              <msb>23</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DMACH24</name>
              <description>DMA Channel 24</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DMACH25</name>
              <description>DMA Channel 25</description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DMACH26</name>
              <description>DMA Channel 26</description>
              <lsb>26</lsb>
              <msb>26</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DMACH27</name>
              <description>DMA Channel 27</description>
              <lsb>27</lsb>
              <msb>27</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DMACH28</name>
              <description>DMA Channel 28</description>
              <lsb>28</lsb>
              <msb>28</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DMACH29</name>
              <description>DMA Channel 29</description>
              <lsb>29</lsb>
              <msb>29</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DMACH30</name>
              <description>DMA Channel 30</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
