m-labs/dslite2svd/svd/tm4c123x-vendor.xml
        <register>
          <name>SRCR1</name>
          <displayName>SYSCTL_SRCR1</displayName>
          <description>Software Reset Control 1</description>
          <addressOffset>0x00000044</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>UART0</name>
              <description>UART0 Reset Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>UART1</name>
              <description>UART1 Reset Control</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>UART2</name>
              <description>UART2 Reset Control</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>SSI0</name>
              <description>SSI0 Reset Control</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>SSI1</name>
              <description>SSI1 Reset Control</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>QEI0</name>
              <description>QEI0 Reset Control</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>QEI1</name>
              <description>QEI1 Reset Control</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>I2C0</name>
              <description>I2C0 Reset Control</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>I2C1</name>
              <description>I2C1 Reset Control</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TIMER0</name>
              <description>Timer 0 Reset Control</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TIMER1</name>
              <description>Timer 1 Reset Control</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TIMER2</name>
              <description>Timer 2 Reset Control</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TIMER3</name>
              <description>Timer 3 Reset Control</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>COMP0</name>
              <description>Analog Comp 0 Reset Control</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>COMP1</name>
              <description>Analog Comp 1 Reset Control</description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SRCR2</name>
          <displayName>SYSCTL_SRCR2</displayName>
          <description>Software Reset Control 2</description>
          <addressOffset>0x00000048</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>GPIOA</name>
              <description>Port A Reset Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>GPIOB</name>
              <description>Port B Reset Control</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>GPIOC</name>
              <description>Port C Reset Control</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>GPIOD</name>
              <description>Port D Reset Control</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>GPIOE</name>
              <description>Port E Reset Control</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>GPIOF</name>
              <description>Port F Reset Control</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>UDMA</name>
              <description>Micro-DMA Reset Control</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>USB0</name>
              <description>USB0 Reset Control</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>RIS</name>
          <displayName>SYSCTL_RIS</displayName>
          <description>Raw Interrupt Status</description>
          <addressOffset>0x00000050</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>BOR1RIS</name>
              <description>VDD under BOR1 Raw Interrupt Status</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MOFRIS</name>
              <description>Main Oscillator Failure Raw Interrupt Status</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PLLLRIS</name>
              <description>PLL Lock Raw Interrupt Status</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>USBPLLLRIS</name>
              <description>USB PLL Lock Raw Interrupt Status</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MOSCPUPRIS</name>
              <description>MOSC Power Up Raw Interrupt Status</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>VDDARIS</name>
              <description>VDDA Power OK Event Raw Interrupt Status</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>BOR0RIS</name>
              <description>VDD under BOR0 Raw Interrupt Status</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>IMC</name>
          <displayName>SYSCTL_IMC</displayName>
          <description>Interrupt Mask Control</description>
          <addressOffset>0x00000054</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>BOR1IM</name>
              <description>VDD under BOR1 Interrupt Mask</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MOFIM</name>
              <description>Main Oscillator Failure Interrupt Mask</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PLLLIM</name>
              <description>PLL Lock Interrupt Mask</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>USBPLLLIM</name>
              <description>USB PLL Lock Interrupt Mask</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MOSCPUPIM</name>
              <description>MOSC Power Up Interrupt Mask</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>VDDAIM</name>
              <description>VDDA Power OK Interrupt Mask</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>BOR0IM</name>
              <description>VDD under BOR0 Interrupt Mask</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>MISC</name>
          <displayName>SYSCTL_MISC</displayName>
          <description>Masked Interrupt Status and Clear</description>
          <addressOffset>0x00000058</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>BOR1MIS</name>
              <description>VDD under BOR1 Masked Interrupt Status</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MOFMIS</name>
              <description>Main Oscillator Failure Masked Interrupt Status</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PLLLMIS</name>
              <description>PLL Lock Masked Interrupt Status</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>USBPLLLMIS</name>
              <description>USB PLL Lock Masked Interrupt Status</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MOSCPUPMIS</name>
              <description>MOSC Power Up Masked Interrupt Status</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>VDDAMIS</name>
              <description>VDDA Power OK Masked Interrupt Status</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>BOR0MIS</name>
              <description>VDD under BOR0 Masked Interrupt Status</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>RESC</name>
          <displayName>SYSCTL_RESC</displayName>
          <description>Reset Cause</description>
          <addressOffset>0x0000005C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EXT</name>
              <description>External Reset</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>POR</name>
              <description>Power-On Reset</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>BOR</name>
              <description>Brown-Out Reset</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>WDT0</name>
              <description>Watchdog Timer 0 Reset</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>SW</name>
              <description>Software Reset</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>WDT1</name>
              <description>Watchdog Timer 1 Reset</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MOSCFAIL</name>
              <description>MOSC Failure Reset</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
