m-labs/dslite2svd/svd/tm4c123x-vendor.xml
        <register>
          <name>RCC</name>
          <displayName>SYSCTL_RCC</displayName>
          <description>Run-Mode Clock Configuration</description>
          <addressOffset>0x00000060</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MOSCDIS</name>
              <description>Main Oscillator Disable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>OSCSRC</name>
              <description>Oscillator Source</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MAIN</name>
                  <description>MOSC</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INT</name>
                  <description>IOSC</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INT4</name>
                  <description>IOSC/4</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_30</name>
                  <description>LFIOSC</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XTAL</name>
              <description>Crystal Value</description>
              <lsb>6</lsb>
              <msb>10</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_4MHZ</name>
                  <description>4 MHz</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_4_09MHZ</name>
                  <description>4.096 MHz</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_4_91MHZ</name>
                  <description>4.9152 MHz</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_5MHZ</name>
                  <description>5 MHz</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_5_12MHZ</name>
                  <description>5.12 MHz</description>
                  <value>0xa</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_6MHZ</name>
                  <description>6 MHz</description>
                  <value>0xb</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_6_14MHZ</name>
                  <description>6.144 MHz</description>
                  <value>0xc</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_7_37MHZ</name>
                  <description>7.3728 MHz</description>
                  <value>0xd</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_8MHZ</name>
                  <description>8 MHz</description>
                  <value>0xe</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_8_19MHZ</name>
                  <description>8.192 MHz</description>
                  <value>0xf</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_10MHZ</name>
                  <description>10 MHz</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_12MHZ</name>
                  <description>12 MHz</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_12_2MHZ</name>
                  <description>12.288 MHz</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_13_5MHZ</name>
                  <description>13.56 MHz</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_14_3MHZ</name>
                  <description>14.31818 MHz</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_16MHZ</name>
                  <description>16 MHz</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_16_3MHZ</name>
                  <description>16.384 MHz</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_18MHZ</name>
                  <description>18.0 MHz (USB)</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_20MHZ</name>
                  <description>20.0 MHz (USB)</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_24MHZ</name>
                  <description>24.0 MHz (USB)</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_25MHZ</name>
                  <description>25.0 MHz (USB)</description>
                  <value>0x1a</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BYPASS</name>
              <description>PLL Bypass</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PWRDN</name>
              <description>PLL Power Down</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PWMDIV</name>
              <description>PWM Unit Clock Divisor</description>
              <lsb>17</lsb>
              <msb>19</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_2</name>
                  <description>PWM clock /2</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_4</name>
                  <description>PWM clock /4</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_8</name>
                  <description>PWM clock /8</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_16</name>
                  <description>PWM clock /16</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_32</name>
                  <description>PWM clock /32</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_64</name>
                  <description>PWM clock /64</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USEPWMDIV</name>
              <description>Enable PWM Clock Divisor</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>USESYSDIV</name>
              <description>Enable System Clock Divider</description>
              <lsb>22</lsb>
              <msb>22</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>SYSDIV</name>
              <description>System Clock Divisor</description>
              <lsb>23</lsb>
              <msb>26</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ACG</name>
              <description>Auto Clock Gating</description>
              <lsb>27</lsb>
              <msb>27</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIOHBCTL</name>
          <displayName>SYSCTL_GPIOHBCTL</displayName>
          <description>GPIO High-Performance Bus Control</description>
          <addressOffset>0x0000006C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PORTA</name>
              <description>Port A Advanced High-Performance Bus</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PORTB</name>
              <description>Port B Advanced High-Performance Bus</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PORTC</name>
              <description>Port C Advanced High-Performance Bus</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PORTD</name>
              <description>Port D Advanced High-Performance Bus</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PORTE</name>
              <description>Port E Advanced High-Performance Bus</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PORTF</name>
              <description>Port F Advanced High-Performance Bus</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>RCC2</name>
          <displayName>SYSCTL_RCC2</displayName>
          <description>Run-Mode Clock Configuration 2</description>
          <addressOffset>0x00000070</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OSCSRC2</name>
              <description>Oscillator Source 2</description>
              <lsb>4</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MO</name>
                  <description>MOSC</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IO</name>
                  <description>PIOSC</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IO4</name>
                  <description>PIOSC/4</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_30</name>
                  <description>LFIOSC</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_32</name>
                  <description>32.768 kHz</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BYPASS2</name>
              <description>PLL Bypass 2</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PWRDN2</name>
              <description>Power-Down PLL 2</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>USBPWRDN</name>
              <description>Power-Down USB PLL</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>SYSDIV2LSB</name>
              <description>Additional LSB for SYSDIV2</description>
              <lsb>22</lsb>
              <msb>22</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>SYSDIV2</name>
              <description>System Clock Divisor 2</description>
              <lsb>23</lsb>
              <msb>28</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DIV400</name>
              <description>Divide PLL as 400 MHz vs. 200 MHz</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>USERCC2</name>
              <description>Use RCC2</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>MOSCCTL</name>
          <displayName>SYSCTL_MOSCCTL</displayName>
          <description>Main Oscillator Control</description>
          <addressOffset>0x0000007C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CVAL</name>
              <description>Clock Validation for MOSC</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MOSCIM</name>
              <description>MOSC Failure Action</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>NOXTAL</name>
              <description>No Crystal Connected</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
