m-labs/dslite2svd/svd/tm4c123x-vendor.xml
        <register>
          <name>RCGC0</name>
          <displayName>SYSCTL_RCGC0</displayName>
          <description>Run Mode Clock Gating Control Register 0</description>
          <addressOffset>0x00000100</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>WDT0</name>
              <description>WDT0 Clock Gating Control</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>HIB</name>
              <description>HIB Clock Gating Control</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ADC0SPD</name>
              <description>ADC0 Sample Speed</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_125K</name>
                  <description>125K samples/second</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_250K</name>
                  <description>250K samples/second</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_500K</name>
                  <description>500K samples/second</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_1M</name>
                  <description>1M samples/second</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC1SPD</name>
              <description>ADC1 Sample Speed</description>
              <lsb>10</lsb>
              <msb>11</msb>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_125K</name>
                  <description>125K samples/second</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_250K</name>
                  <description>250K samples/second</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_500K</name>
                  <description>500K samples/second</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_1M</name>
                  <description>1M samples/second</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC0</name>
              <description>ADC0 Clock Gating Control</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ADC1</name>
              <description>ADC1 Clock Gating Control</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PWM0</name>
              <description>PWM Clock Gating Control</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CAN0</name>
              <description>CAN0 Clock Gating Control</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CAN1</name>
              <description>CAN1 Clock Gating Control</description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>WDT1</name>
              <description>WDT1 Clock Gating Control</description>
              <lsb>28</lsb>
              <msb>28</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>RCGC1</name>
          <displayName>SYSCTL_RCGC1</displayName>
          <description>Run Mode Clock Gating Control Register 1</description>
          <addressOffset>0x00000104</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>UART0</name>
              <description>UART0 Clock Gating Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>UART1</name>
              <description>UART1 Clock Gating Control</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>UART2</name>
              <description>UART2 Clock Gating Control</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>SSI0</name>
              <description>SSI0 Clock Gating Control</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>SSI1</name>
              <description>SSI1 Clock Gating Control</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>QEI0</name>
              <description>QEI0 Clock Gating Control</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>QEI1</name>
              <description>QEI1 Clock Gating Control</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>I2C0</name>
              <description>I2C0 Clock Gating Control</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>I2C1</name>
              <description>I2C1 Clock Gating Control</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TIMER0</name>
              <description>Timer 0 Clock Gating Control</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TIMER1</name>
              <description>Timer 1 Clock Gating Control</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TIMER2</name>
              <description>Timer 2 Clock Gating Control</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TIMER3</name>
              <description>Timer 3 Clock Gating Control</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>COMP0</name>
              <description>Analog Comparator 0 Clock Gating</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>COMP1</name>
              <description>Analog Comparator 1 Clock Gating</description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>RCGC2</name>
          <displayName>SYSCTL_RCGC2</displayName>
          <description>Run Mode Clock Gating Control Register 2</description>
          <addressOffset>0x00000108</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>GPIOA</name>
              <description>Port A Clock Gating Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>GPIOB</name>
              <description>Port B Clock Gating Control</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>GPIOC</name>
              <description>Port C Clock Gating Control</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>GPIOD</name>
              <description>Port D Clock Gating Control</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>GPIOE</name>
              <description>Port E Clock Gating Control</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>GPIOF</name>
              <description>Port F Clock Gating Control</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>UDMA</name>
              <description>Micro-DMA Clock Gating Control</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>USB0</name>
              <description>USB0 Clock Gating Control</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SCGC0</name>
          <displayName>SYSCTL_SCGC0</displayName>
          <description>Sleep Mode Clock Gating Control Register 0</description>
          <addressOffset>0x00000110</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>WDT0</name>
              <description>WDT0 Clock Gating Control</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>HIB</name>
              <description>HIB Clock Gating Control</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ADC0</name>
              <description>ADC0 Clock Gating Control</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ADC1</name>
              <description>ADC1 Clock Gating Control</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PWM0</name>
              <description>PWM Clock Gating Control</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CAN0</name>
              <description>CAN0 Clock Gating Control</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CAN1</name>
              <description>CAN1 Clock Gating Control</description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>WDT1</name>
              <description>WDT1 Clock Gating Control</description>
              <lsb>28</lsb>
              <msb>28</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
