m-labs/dslite2svd/svd/tm4c123x-vendor.xml
        <register>
          <name>PPI2C</name>
          <displayName>SYSCTL_PPI2C</displayName>
          <description>Inter-Integrated Circuit Peripheral Present</description>
          <addressOffset>0x00000320</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>P0</name>
              <description>I2C Module 0 Present</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>P1</name>
              <description>I2C Module 1 Present</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>P2</name>
              <description>I2C Module 2 Present</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>P3</name>
              <description>I2C Module 3 Present</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>P4</name>
              <description>I2C Module 4 Present</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>P5</name>
              <description>I2C Module 5 Present</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PPUSB</name>
          <displayName>SYSCTL_PPUSB</displayName>
          <description>Universal Serial Bus Peripheral Present</description>
          <addressOffset>0x00000328</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>P0</name>
              <description>USB Module Present</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PPCAN</name>
          <displayName>SYSCTL_PPCAN</displayName>
          <description>Controller Area Network Peripheral Present</description>
          <addressOffset>0x00000334</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>P0</name>
              <description>CAN Module 0 Present</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>P1</name>
              <description>CAN Module 1 Present</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PPADC</name>
          <displayName>SYSCTL_PPADC</displayName>
          <description>Analog-to-Digital Converter Peripheral Present</description>
          <addressOffset>0x00000338</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>P0</name>
              <description>ADC Module 0 Present</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>P1</name>
              <description>ADC Module 1 Present</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PPACMP</name>
          <displayName>SYSCTL_PPACMP</displayName>
          <description>Analog Comparator Peripheral Present</description>
          <addressOffset>0x0000033C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>P0</name>
              <description>Analog Comparator Module Present</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PPPWM</name>
          <displayName>SYSCTL_PPPWM</displayName>
          <description>Pulse Width Modulator Peripheral Present</description>
          <addressOffset>0x00000340</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>P0</name>
              <description>PWM Module 0 Present</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>P1</name>
              <description>PWM Module 1 Present</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PPQEI</name>
          <displayName>SYSCTL_PPQEI</displayName>
          <description>Quadrature Encoder Interface Peripheral Present</description>
          <addressOffset>0x00000344</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>P0</name>
              <description>QEI Module 0 Present</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>P1</name>
              <description>QEI Module 1 Present</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PPEEPROM</name>
          <displayName>SYSCTL_PPEEPROM</displayName>
          <description>EEPROM Peripheral Present</description>
          <addressOffset>0x00000358</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>P0</name>
              <description>EEPROM Module Present</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PPWTIMER</name>
          <displayName>SYSCTL_PPWTIMER</displayName>
          <description>32/64-Bit Wide General-Purpose Timer Peripheral Present</description>
          <addressOffset>0x0000035C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>P0</name>
              <description>32/64-Bit Wide General-Purpose Timer 0 Present</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>P1</name>
              <description>32/64-Bit Wide General-Purpose Timer 1 Present</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>P2</name>
              <description>32/64-Bit Wide General-Purpose Timer 2 Present</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>P3</name>
              <description>32/64-Bit Wide General-Purpose Timer 3 Present</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>P4</name>
              <description>32/64-Bit Wide General-Purpose Timer 4 Present</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>P5</name>
              <description>32/64-Bit Wide General-Purpose Timer 5 Present</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SRWD</name>
          <displayName>SYSCTL_SRWD</displayName>
          <description>Watchdog Timer Software Reset</description>
          <addressOffset>0x00000500</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>R0</name>
              <description>Watchdog Timer 0 Software Reset</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>R1</name>
              <description>Watchdog Timer 1 Software Reset</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SRTIMER</name>
          <displayName>SYSCTL_SRTIMER</displayName>
          <description>16/32-Bit General-Purpose Timer Software Reset</description>
          <addressOffset>0x00000504</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>R0</name>
              <description>16/32-Bit General-Purpose Timer 0 Software Reset</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>R1</name>
              <description>16/32-Bit General-Purpose Timer 1 Software Reset</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>R2</name>
              <description>16/32-Bit General-Purpose Timer 2 Software Reset</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>R3</name>
              <description>16/32-Bit General-Purpose Timer 3 Software Reset</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>R4</name>
              <description>16/32-Bit General-Purpose Timer 4 Software Reset</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>R5</name>
              <description>16/32-Bit General-Purpose Timer 5 Software Reset</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SRGPIO</name>
          <displayName>SYSCTL_SRGPIO</displayName>
          <description>General-Purpose Input/Output Software Reset</description>
          <addressOffset>0x00000508</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>R0</name>
              <description>GPIO Port A Software Reset</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>R1</name>
              <description>GPIO Port B Software Reset</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>R2</name>
              <description>GPIO Port C Software Reset</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>R3</name>
              <description>GPIO Port D Software Reset</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>R4</name>
              <description>GPIO Port E Software Reset</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>R5</name>
              <description>GPIO Port F Software Reset</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SRDMA</name>
          <displayName>SYSCTL_SRDMA</displayName>
          <description>Micro Direct Memory Access Software Reset</description>
          <addressOffset>0x0000050C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>R0</name>
              <description>uDMA Module Software Reset</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SRHIB</name>
          <displayName>SYSCTL_SRHIB</displayName>
          <description>Hibernation Software Reset</description>
          <addressOffset>0x00000514</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>R0</name>
              <description>Hibernation Module Software Reset</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
