m-labs/dslite2svd/svd/tm4c123x-vendor.xml
        <register>
          <name>SCGCWD</name>
          <displayName>SYSCTL_SCGCWD</displayName>
          <description>Watchdog Timer Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000700</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>S0</name>
              <description>Watchdog Timer 0 Sleep Mode Clock Gating Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>S1</name>
              <description>Watchdog Timer 1 Sleep Mode Clock Gating Control</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SCGCTIMER</name>
          <displayName>SYSCTL_SCGCTIMER</displayName>
          <description>16/32-Bit General-Purpose Timer Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000704</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>S0</name>
              <description>16/32-Bit General-Purpose Timer 0 Sleep Mode Clock Gating Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>S1</name>
              <description>16/32-Bit General-Purpose Timer 1 Sleep Mode Clock Gating Control</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>S2</name>
              <description>16/32-Bit General-Purpose Timer 2 Sleep Mode Clock Gating Control</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>S3</name>
              <description>16/32-Bit General-Purpose Timer 3 Sleep Mode Clock Gating Control</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>S4</name>
              <description>16/32-Bit General-Purpose Timer 4 Sleep Mode Clock Gating Control</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>S5</name>
              <description>16/32-Bit General-Purpose Timer 5 Sleep Mode Clock Gating Control</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SCGCGPIO</name>
          <displayName>SYSCTL_SCGCGPIO</displayName>
          <description>General-Purpose Input/Output Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000708</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>S0</name>
              <description>GPIO Port A Sleep Mode Clock Gating Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>S1</name>
              <description>GPIO Port B Sleep Mode Clock Gating Control</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>S2</name>
              <description>GPIO Port C Sleep Mode Clock Gating Control</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>S3</name>
              <description>GPIO Port D Sleep Mode Clock Gating Control</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>S4</name>
              <description>GPIO Port E Sleep Mode Clock Gating Control</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>S5</name>
              <description>GPIO Port F Sleep Mode Clock Gating Control</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SCGCDMA</name>
          <displayName>SYSCTL_SCGCDMA</displayName>
          <description>Micro Direct Memory Access Sleep Mode Clock Gating Control</description>
          <addressOffset>0x0000070C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>S0</name>
              <description>uDMA Module Sleep Mode Clock Gating Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SCGCHIB</name>
          <displayName>SYSCTL_SCGCHIB</displayName>
          <description>Hibernation Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000714</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>S0</name>
              <description>Hibernation Module Sleep Mode Clock Gating Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SCGCUART</name>
          <displayName>SYSCTL_SCGCUART</displayName>
          <description>Universal Asynchronous Receiver/Transmitter Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000718</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>S0</name>
              <description>UART Module 0 Sleep Mode Clock Gating Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>S1</name>
              <description>UART Module 1 Sleep Mode Clock Gating Control</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>S2</name>
              <description>UART Module 2 Sleep Mode Clock Gating Control</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>S3</name>
              <description>UART Module 3 Sleep Mode Clock Gating Control</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>S4</name>
              <description>UART Module 4 Sleep Mode Clock Gating Control</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>S5</name>
              <description>UART Module 5 Sleep Mode Clock Gating Control</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>S6</name>
              <description>UART Module 6 Sleep Mode Clock Gating Control</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>S7</name>
              <description>UART Module 7 Sleep Mode Clock Gating Control</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SCGCSSI</name>
          <displayName>SYSCTL_SCGCSSI</displayName>
          <description>Synchronous Serial Interface Sleep Mode Clock Gating Control</description>
          <addressOffset>0x0000071C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>S0</name>
              <description>SSI Module 0 Sleep Mode Clock Gating Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>S1</name>
              <description>SSI Module 1 Sleep Mode Clock Gating Control</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>S2</name>
              <description>SSI Module 2 Sleep Mode Clock Gating Control</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>S3</name>
              <description>SSI Module 3 Sleep Mode Clock Gating Control</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SCGCI2C</name>
          <displayName>SYSCTL_SCGCI2C</displayName>
          <description>Inter-Integrated Circuit Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000720</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>S0</name>
              <description>I2C Module 0 Sleep Mode Clock Gating Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>S1</name>
              <description>I2C Module 1 Sleep Mode Clock Gating Control</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>S2</name>
              <description>I2C Module 2 Sleep Mode Clock Gating Control</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>S3</name>
              <description>I2C Module 3 Sleep Mode Clock Gating Control</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SCGCUSB</name>
          <displayName>SYSCTL_SCGCUSB</displayName>
          <description>Universal Serial Bus Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000728</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>S0</name>
              <description>USB Module Sleep Mode Clock Gating Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SCGCCAN</name>
          <displayName>SYSCTL_SCGCCAN</displayName>
          <description>Controller Area Network Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000734</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>S0</name>
              <description>CAN Module 0 Sleep Mode Clock Gating Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>S1</name>
              <description>CAN Module 1 Sleep Mode Clock Gating Control</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SCGCADC</name>
          <displayName>SYSCTL_SCGCADC</displayName>
          <description>Analog-to-Digital Converter Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000738</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>S0</name>
              <description>ADC Module 0 Sleep Mode Clock Gating Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>S1</name>
              <description>ADC Module 1 Sleep Mode Clock Gating Control</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SCGCACMP</name>
          <displayName>SYSCTL_SCGCACMP</displayName>
          <description>Analog Comparator Sleep Mode Clock Gating Control</description>
          <addressOffset>0x0000073C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>S0</name>
              <description>Analog Comparator Module 0 Sleep Mode Clock Gating Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SCGCPWM</name>
          <displayName>SYSCTL_SCGCPWM</displayName>
          <description>Pulse Width Modulator Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000740</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>S0</name>
              <description>PWM Module 0 Sleep Mode Clock Gating Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>S1</name>
              <description>PWM Module 1 Sleep Mode Clock Gating Control</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SCGCQEI</name>
          <displayName>SYSCTL_SCGCQEI</displayName>
          <description>Quadrature Encoder Interface Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000744</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>S0</name>
              <description>QEI Module 0 Sleep Mode Clock Gating Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>S1</name>
              <description>QEI Module 1 Sleep Mode Clock Gating Control</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
