m-labs/dslite2svd/svd/tm4c123x-vendor.xml
        <register>
          <name>DCGCADC</name>
          <displayName>SYSCTL_DCGCADC</displayName>
          <description>Analog-to-Digital Converter Deep-Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000838</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>D0</name>
              <description>ADC Module 0 Deep-Sleep Mode Clock Gating Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>D1</name>
              <description>ADC Module 1 Deep-Sleep Mode Clock Gating Control</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DCGCACMP</name>
          <displayName>SYSCTL_DCGCACMP</displayName>
          <description>Analog Comparator Deep-Sleep Mode Clock Gating Control</description>
          <addressOffset>0x0000083C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>D0</name>
              <description>Analog Comparator Module 0 Deep-Sleep Mode Clock Gating Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DCGCPWM</name>
          <displayName>SYSCTL_DCGCPWM</displayName>
          <description>Pulse Width Modulator Deep-Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000840</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>D0</name>
              <description>PWM Module 0 Deep-Sleep Mode Clock Gating Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>D1</name>
              <description>PWM Module 1 Deep-Sleep Mode Clock Gating Control</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DCGCQEI</name>
          <displayName>SYSCTL_DCGCQEI</displayName>
          <description>Quadrature Encoder Interface Deep-Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000844</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>D0</name>
              <description>QEI Module 0 Deep-Sleep Mode Clock Gating Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>D1</name>
              <description>QEI Module 1 Deep-Sleep Mode Clock Gating Control</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DCGCEEPROM</name>
          <displayName>SYSCTL_DCGCEEPROM</displayName>
          <description>EEPROM Deep-Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000858</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>D0</name>
              <description>EEPROM Module Deep-Sleep Mode Clock Gating Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DCGCWTIMER</name>
          <displayName>SYSCTL_DCGCWTIMER</displayName>
          <description>32/64-Bit Wide General-Purpose Timer Deep-Sleep Mode Clock Gating Control</description>
          <addressOffset>0x0000085C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>D0</name>
              <description>32/64-Bit Wide General-Purpose Timer 0 Deep-Sleep Mode Clock Gating Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>D1</name>
              <description>32/64-Bit Wide General-Purpose Timer 1 Deep-Sleep Mode Clock Gating Control</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>D2</name>
              <description>32/64-Bit Wide General-Purpose Timer 2 Deep-Sleep Mode Clock Gating Control</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>D3</name>
              <description>32/64-Bit Wide General-Purpose Timer 3 Deep-Sleep Mode Clock Gating Control</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>D4</name>
              <description>32/64-Bit Wide General-Purpose Timer 4 Deep-Sleep Mode Clock Gating Control</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>D5</name>
              <description>32/64-Bit Wide General-Purpose Timer 5 Deep-Sleep Mode Clock Gating Control</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PRWD</name>
          <displayName>SYSCTL_PRWD</displayName>
          <description>Watchdog Timer Peripheral Ready</description>
          <addressOffset>0x00000A00</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>R0</name>
              <description>Watchdog Timer 0 Peripheral Ready</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>R1</name>
              <description>Watchdog Timer 1 Peripheral Ready</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PRTIMER</name>
          <displayName>SYSCTL_PRTIMER</displayName>
          <description>16/32-Bit General-Purpose Timer Peripheral Ready</description>
          <addressOffset>0x00000A04</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>R0</name>
              <description>16/32-Bit General-Purpose Timer 0 Peripheral Ready</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>R1</name>
              <description>16/32-Bit General-Purpose Timer 1 Peripheral Ready</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>R2</name>
              <description>16/32-Bit General-Purpose Timer 2 Peripheral Ready</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>R3</name>
              <description>16/32-Bit General-Purpose Timer 3 Peripheral Ready</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>R4</name>
              <description>16/32-Bit General-Purpose Timer 4 Peripheral Ready</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>R5</name>
              <description>16/32-Bit General-Purpose Timer 5 Peripheral Ready</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PRGPIO</name>
          <displayName>SYSCTL_PRGPIO</displayName>
          <description>General-Purpose Input/Output Peripheral Ready</description>
          <addressOffset>0x00000A08</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>R0</name>
              <description>GPIO Port A Peripheral Ready</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>R1</name>
              <description>GPIO Port B Peripheral Ready</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>R2</name>
              <description>GPIO Port C Peripheral Ready</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>R3</name>
              <description>GPIO Port D Peripheral Ready</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>R4</name>
              <description>GPIO Port E Peripheral Ready</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>R5</name>
              <description>GPIO Port F Peripheral Ready</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PRDMA</name>
          <displayName>SYSCTL_PRDMA</displayName>
          <description>Micro Direct Memory Access Peripheral Ready</description>
          <addressOffset>0x00000A0C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>R0</name>
              <description>uDMA Module Peripheral Ready</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PRHIB</name>
          <displayName>SYSCTL_PRHIB</displayName>
          <description>Hibernation Peripheral Ready</description>
          <addressOffset>0x00000A14</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>R0</name>
              <description>Hibernation Module Peripheral Ready</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PRUART</name>
          <displayName>SYSCTL_PRUART</displayName>
          <description>Universal Asynchronous Receiver/Transmitter Peripheral Ready</description>
          <addressOffset>0x00000A18</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>R0</name>
              <description>UART Module 0 Peripheral Ready</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>R1</name>
              <description>UART Module 1 Peripheral Ready</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>R2</name>
              <description>UART Module 2 Peripheral Ready</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>R3</name>
              <description>UART Module 3 Peripheral Ready</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>R4</name>
              <description>UART Module 4 Peripheral Ready</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>R5</name>
              <description>UART Module 5 Peripheral Ready</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>R6</name>
              <description>UART Module 6 Peripheral Ready</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>R7</name>
              <description>UART Module 7 Peripheral Ready</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PRSSI</name>
          <displayName>SYSCTL_PRSSI</displayName>
          <description>Synchronous Serial Interface Peripheral Ready</description>
          <addressOffset>0x00000A1C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>R0</name>
              <description>SSI Module 0 Peripheral Ready</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>R1</name>
              <description>SSI Module 1 Peripheral Ready</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>R2</name>
              <description>SSI Module 2 Peripheral Ready</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>R3</name>
              <description>SSI Module 3 Peripheral Ready</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
