m-labs/dslite2svd/svd/tm4c123x-vendor.xml
        <register>
          <name>PRI2C</name>
          <displayName>SYSCTL_PRI2C</displayName>
          <description>Inter-Integrated Circuit Peripheral Ready</description>
          <addressOffset>0x00000A20</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>R0</name>
              <description>I2C Module 0 Peripheral Ready</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>R1</name>
              <description>I2C Module 1 Peripheral Ready</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>R2</name>
              <description>I2C Module 2 Peripheral Ready</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>R3</name>
              <description>I2C Module 3 Peripheral Ready</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PRUSB</name>
          <displayName>SYSCTL_PRUSB</displayName>
          <description>Universal Serial Bus Peripheral Ready</description>
          <addressOffset>0x00000A28</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>R0</name>
              <description>USB Module Peripheral Ready</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PRCAN</name>
          <displayName>SYSCTL_PRCAN</displayName>
          <description>Controller Area Network Peripheral Ready</description>
          <addressOffset>0x00000A34</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>R0</name>
              <description>CAN Module 0 Peripheral Ready</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>R1</name>
              <description>CAN Module 1 Peripheral Ready</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PRADC</name>
          <displayName>SYSCTL_PRADC</displayName>
          <description>Analog-to-Digital Converter Peripheral Ready</description>
          <addressOffset>0x00000A38</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>R0</name>
              <description>ADC Module 0 Peripheral Ready</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>R1</name>
              <description>ADC Module 1 Peripheral Ready</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PRACMP</name>
          <displayName>SYSCTL_PRACMP</displayName>
          <description>Analog Comparator Peripheral Ready</description>
          <addressOffset>0x00000A3C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>R0</name>
              <description>Analog Comparator Module 0 Peripheral Ready</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PRPWM</name>
          <displayName>SYSCTL_PRPWM</displayName>
          <description>Pulse Width Modulator Peripheral Ready</description>
          <addressOffset>0x00000A40</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>R0</name>
              <description>PWM Module 0 Peripheral Ready</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>R1</name>
              <description>PWM Module 1 Peripheral Ready</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PRQEI</name>
          <displayName>SYSCTL_PRQEI</displayName>
          <description>Quadrature Encoder Interface Peripheral Ready</description>
          <addressOffset>0x00000A44</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>R0</name>
              <description>QEI Module 0 Peripheral Ready</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>R1</name>
              <description>QEI Module 1 Peripheral Ready</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PREEPROM</name>
          <displayName>SYSCTL_PREEPROM</displayName>
          <description>EEPROM Peripheral Ready</description>
          <addressOffset>0x00000A58</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>R0</name>
              <description>EEPROM Module Peripheral Ready</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PRWTIMER</name>
          <displayName>SYSCTL_PRWTIMER</displayName>
          <description>32/64-Bit Wide General-Purpose Timer Peripheral Ready</description>
          <addressOffset>0x00000A5C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>R0</name>
              <description>32/64-Bit Wide General-Purpose Timer 0 Peripheral Ready</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>R1</name>
              <description>32/64-Bit Wide General-Purpose Timer 1 Peripheral Ready</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>R2</name>
              <description>32/64-Bit Wide General-Purpose Timer 2 Peripheral Ready</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>R3</name>
              <description>32/64-Bit Wide General-Purpose Timer 3 Peripheral Ready</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>R4</name>
              <description>32/64-Bit Wide General-Purpose Timer 4 Peripheral Ready</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>R5</name>
              <description>32/64-Bit Wide General-Purpose Timer 5 Peripheral Ready</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
